{
  "1": {
    "type": "choice",
    "text": "The walk to Port Blacksand takes you west... At the gate you are confronted by a tall guard... 'Who would enter Port Blacksand uninvited? State the nature of your business or go back the way you came.'",
    "choices": {
      "Tell him you wish to be taken to Nicodemus.": "202",
      "Tell him you wish to sell some stolen booty.": "33",
      "Attack him quickly with your sword.": "49"
    }
  },
  "2": {
    "type": "choice",
    "text": "You remove the bracelet from your wrist and toss it at the oncoming monster... Finally, it is still... You walk further down the tunnel, which ends at an iron grill through which the sewage runs.",
    "choices": {
      "Remove the grill.": "377",
      "Walk back to the entrance hole.": "174"
    }
  },
  "3": {
    "type": "transaction",
    "text": "The man stops playing and tells you that he can bring you good fortune. For the sum of 3 Gold Pieces he will sing you a song that will bring you luck.",
    "choices": {
      "Pay the musician 3 Gold Pieces.": { "cost": 3, "next": "37" },
      "Do not believe him and walk to the next stall.": {
        "cost": 0,
        "next": "398"
      }
    }
  },
  "4": {
    "type": "choice",
    "text": "You hear a bell ring... a few minutes later the door is opened by a thin, pale-skinned man... In a cold, hissing voice he says, 'Yes?'",
    "choices": {
      "Tell him you are a lost traveller.": "339",
      "Attack him with your sword.": "35"
    }
  },
  "5": {
    "type": "combat",
    "text": "Drawing your sword you leap over the counter to attack the MAN-ORC, who swiftly grabs his hand-axe. You soon realize that the Man-Orc has used his weapon before.",
    "enemies": ["man_orc_1"],
    "outcomes": {
      "win": "371",
      "lose": "GAME_OVER"
    }
  },
  "6": {
    "type": "choice",
    "text": "Her tone becomes unpleasant and she tells you to get out of her house... 'there are certainly no rags in it...'",
    "choices": {
      "Obey her and leave.": "333",
      "Go through the curtains to see who is being so rude.": "88"
    }
  },
  "7": {
    "type": "effect",
    "text": "You tiptoe quietly out of the room and close the door. In the corridor you open the pouch and find six black pearls. Add 2 Luck points.",
    "effects": {
      "luck": 2,
      "add_items": ["Six Black Pearls"]
    },
    "next": "7_choice"
  },
  "7_choice": {
    "type": "choice",
    "text": "You now have a choice. What will you do?",
    "choices": {
      "Open the other door (if you have not already done so).": "232",
      "Leave the ship and walk north up Harbour Street.": "78"
    }
  },
  "8": {
    "type": "effect",
    "text": "The creature pins the golden brooch to your leather tunic and you pay the price demanded. You have bought a lucky charm - add 2 Luck points to your total. Pleased with your purchase you leave the house and head north.",
    "effects": {
      "luck": 2,
      "add_items": ["Golden Brooch (Lucky)"]
    },
    "next": "334"
  },
  "9": {
    "type": "game_over",
    "text": "You step back from the vile body of Zanbar Bone... you have chosen wrongly!!! He pulls the arrow from his chest... He walks up to you and touches your face with his skeletal fingers. Your life is draining quickly away and you will soon begin your undead existence as a servant of Zanbar Bone."
  },
  "10": {
    "type": "combat",
    "text": "The GUARD is really annoyed and charges at you with his pike.",
    "enemies": ["city_guard_1"],
    "rules": {
      "max_rounds": 6
    },
    "outcomes": {
      "win_fast": "212",
      "win_slow": "130",
      "lose": "GAME_OVER"
    }
  },
  "11": {
    "type": "auto",
    "text": "The Trolls see what you are doing and run towards the tree. You are forced to leave your shield behind. After climbing quickly up the tree you realize that you must jump a distance of two metres between the branch and the top of the wall.",
    "next": "11_condition_shield"
  },
  "11_condition_shield": {
    "type": "condition_item",
    "check": { "item": "Shield" },
    "outcomes": {
      "success": "11_effect_shield",
      "failure": "11_condition_chainmail"
    }
  },
  "11_effect_shield": {
    "type": "effect",
    "text": "You are forced to leave your shield behind.",
    "effects": { "skill": -1, "remove_items": ["Shield"] },
    "next": "11_condition_chainmail"
  },
  "11_condition_chainmail": {
    "type": "condition_item",
    "check": { "item": "Chainmail Coat" },
    "outcomes": {
      "success": "11_effect_chainmail",
      "failure": "11_text_jump"
    }
  },
  "11_effect_chainmail": {
    "type": "effect",
    "text": "Because you are wearing a chainmail coat, you will have to take it off in order to jump safely across to the wall.",
    "effects": { "skill": -2, "remove_items": ["Chainmail Coat"] },
    "next": "11_text_jump"
  },
  "11_text_jump": {
    "type": "auto",
    "text": "Below, you see the two Trolls running round the tree waving their swords at you. There is no alternative but to jump.",
    "next": "358"
  },
  "12": {
    "type": "choice",
    "text": "After a few minutes you hear footsteps coming down the corridor... a man walks into the room... and lowers himself gently into the tub with a loud sigh.",
    "choices": {
      "Surprise him by drawing your sword and uttering a loud 'Ahem!'.": "176",
      "Creep out of the room back into the corridor.": "383"
    }
  },
  "13": {
    "type": "effect",
    "text": "Inspecting the scorpion you see that it is a brooch. You decide to pin it to your leather tunic. The brooch has magic healing properties: After any battle, the brooch will immediately restore 1 STAMINA point to your total.",
    "effects": { "add_items": ["Silver Scorpion Brooch (Healing)"] },
    "next": "13_choice"
  },
  "13_choice": {
    "type": "choice",
    "text": "What will you do next?",
    "choices": {
      "Pick up the golden scorpion (if you have not already done so).": "273",
      "Climb the stairs.": "80",
      "Leave the house and head north.": "334"
    }
  },
  "14": {
    "type": "auto",
    "text": "As soon as you pluck one of the flowers you hear the noise of rustling leaves. Three of the animal-shaped hedges have uprooted themselves and are closing in on you.",
    "next": "14_condition"
  },
  "14_condition": {
    "type": "condition_item",
    "text": "Do you have a Ring of Fire?",
    "check": { "item": "Ring of Fire" },
    "outcomes": {
      "success": "237",
      "failure": "191"
    }
  },
  "15": {
    "type": "luck_test",
    "text": "You leap over the snakes and run for the door. Test your Luck.",
    "outcomes": {
      "lucky": "75",
      "unlucky": "298"
    }
  },
  "16": {
    "type": "effect",
    "text": "The bag holds 12 Gold Pieces. Add 1 LUCK point. You leave the house quickly before the owner discovers you are not who you say you are. You then walk further north along stable street.",
    "effects": { "gold": 12, "luck": 1 },
    "next": "333"
  },
  "17": {
    "type": "choice",
    "text": "Walking along the narrow street you see a man wearing tattered rags sitting in the gutter. He looks thoroughly miserable.",
    "choices": {
      "Stop to talk to him.": "331",
      "Continue walking east.": "161"
    }
  },
  "18": {
    "type": "skill_test",
    "text": "You take aim carefully and throw the knife at the leading vagabond. Roll two dice. If the total is the same or less than your SKILL score, the knife sinks deep into his chest.",
    "outcomes": {
      "success": "102",
      "failure": "225"
    }
  },
  "19": {
    "type": "effect",
    "text": "The darts are poison-tipped. Lose 4 STAMINA points and 1 SKILL point.",
    "effects": { "stamina": -4, "skill": -1 },
    "next": "19_choice"
  },
  "19_choice": {
    "type": "choice",
    "text": "If you are still alive, what will you do?",
    "choices": {
      "Continue picking the lock.": "340",
      "Leave the room and climb the stairs.": "60"
    }
  },
  "20": {
    "type": "auto",
    "text": "The pirate's pockets contain nothing apart from a piece of stale bread. You leave him to start a search of the wooden boxes and barrels on the ship's deck.",
    "next": "84"
  },
  "21": {
    "type": "choice",
    "text": "Looking up, you see that the staircase goes all the way up to the top of the tower. You stop off at the first floor... The door opens into a large room which contains a comfortable, made-up bed.",
    "choices": {
      "Lock the door and go to sleep for the night.": "288",
      "Explore the tower further.": "77"
    }
  },
  "22": {
    "type": "combat",
    "text": "As you sit down at the table the GOBLINS stop their quarrelling and stare at you coldly... Suddenly they stand up and draw their swords. You must fight them one at a time.",
    "enemies": ["goblin_1", "goblin_2"],
    "outcomes": {
      "win": "198",
      "lose": "GAME_OVER"
    }
  },
  "23": {
    "type": "combat",
    "text": "The man grabs a wooden club from behind a chair and prepares to fight you. He is strong but not a good fighter.",
    "enemies": ["silversmith_1"],
    "outcomes": {
      "win": "146",
      "lose": "GAME_OVER"
    }
  },
  "24": {
    "type": "choice",
    "text": "There is another shop on the left side of the street. An iron grill over the window prevents you seeing what kind of shop it is. You try the handle on the door and it turns.",
    "choices": {
      "Enter the shop.": "336",
      "Continue west, without looking into the shop.": "196"
    }
  },
  "25": {
    "type": "choice",
    "text": "You soon realize you are in a stable when you see a large, bare-chested man... busy at work at an open fire.",
    "choices": {
      "Make conversation with the blacksmith.": "169",
      "Attack him with your sword.": "323",
      "Leave him to his labours and continue north.": "115"
    }
  },
  "26": {
    "type": "auto",
    "text": "You sheathe your sword and look round at the circle of spectators... The innkeeper apologizes... and tells you Nicodemus lives under Singing Bridge... You tell the innkeeper not to be so discourteous to strangers next time, and leave the tavern to head north.",
    "next": "296"
  },
  "27": {
    "type": "choice",
    "text": "You enter a small candlelit room... A man... places six white pills on top of six skulls on the table, looks up to you and says, 'One of the pills before you is deadly poisonous... Swallow one of your choice. If you live, I will give you 20 Gold Pieces.'",
    "choices": {
      "Play this deadly game.": "223",
      "Leave this room and walk back up the alley.": "165"
    }
  },
  "28": {
    "type": "choice",
    "text": "While you were fighting the Giant Rats, you thought you saw someone or something skulking in the shadows ahead.",
    "choices": {
      "Continue further north along the tunnel.": "265",
      "Turn round and walk back to the entrance hole.": "104"
    }
  },
  "29": {
    "type": "choice",
    "text": "You squat down on the mattress and consider what to do next.",
    "choices": {
      "Feign illness and throw the iron pail against the bars.": "143",
      "Inspect the cell closely for a secret escape route.": "230"
    }
  },
  "30": {
    "type": "auto",
    "text": "Tower Street soon ends at a junction, where it meets Stable Street running north and south. You decide to go north.",
    "next": "76"
  },
  "31": {
    "type": "choice",
    "text": "Ahead you see a wooden bridge stretching over a dirty river... Almost hidden from view is a small flight of steps going down underneath the bridge... A one-legged man carrying a sack is crossing...",
    "choices": {
      "Climb down the steps.": "329",
      "Wait to talk to the man.": "364"
    }
  },
  "32": {
    "type": "effect",
    "text": "Before you reach the door, the Serpent Queen extends her head and bites you on the neck.",
    "effects": { "stamina": -4, "skill": -1 },
    "next": "32_combat"
  },
  "32_combat": {
    "type": "combat",
    "text": "If you are still alive, you draw your sword to attack the Serpent Queen.",
    "enemies": ["serpent_queen_1"],
    "outcomes": { "win": "249", "lose": "GAME_OVER" }
  },
  "33": {
    "type": "choice",
    "text": "You tell the guard that you wish to sell some silver chalices... The guard looks at you suspiciously, saying, 'Let me look at these chalices in your backpack before I admit you.'",
    "choices": {
      "Tell him the chalices are cursed.": "381",
      "Try to run past the guard.": "291",
      "Attack him quickly.": "49"
    }
  },
  "34": {
    "type": "auto",
    "text": "The carriage thunders by... As the noise fades into the distance, you step out on to the street and continue west.",
    "next": "171"
  },
  "35": {
    "type": "effect",
    "text": "You push the man through the doorway and run him through with your sword. Much to your surprise he is unaffected... He grabs your arm... you kick him away. He has left a mark on your arm which looks like a burn.",
    "effects": { "stamina": -2 },
    "next": "35_choice"
  },
  "35_choice": {
    "type": "choice",
    "text": "Then you realize that before you stands a Spirit Stalker... you try to remember what you must do.",
    "choices": {
      "Fire the silver arrow at him.": "189",
      "Reflect his stare in your mirror (if you have one).": "35_check_mirror",
      "Fire your Ring of Ice at him (if you have one).": "35_check_ice_ring"
    }
  },
  "35_check_mirror": {
    "type": "condition_item",
    "check": { "item": "Mirror" },
    "outcomes": { "success": "305", "failure": "35_fail_item_check" }
  },
  "35_check_ice_ring": {
    "type": "condition_item",
    "check": { "item": "Ring of Ice" },
    "outcomes": { "success": "382", "failure": "35_fail_item_check" }
  },
  "35_fail_item_check": {
    "type": "auto",
    "text": "You don't have that item!",
    "next": "35_choice"
  },
  "36": {
    "type": "shop",
    "text": "The man leans on the counter and tells you that a Ring of Invisibility costs 10 Gold Pieces, a Ring of Fire costs 8 Gold Pieces, and a Ring of Ice costs 7 Gold Pieces. You may buy one.",
    "items": {
      "Ring of Invisibility": 10,
      "Ring of Fire": 8,
      "Ring of Ice": 7
    },
    "next": "196"
  },
  "37": {
    "type": "effect",
    "text": "The man strums his lyre and sings a merry song all about you and your good fortune - he does have the power to make you lucky. You walk on to the next stall.",
    "effects": { "luck": 2 },
    "next": "398"
  },
  "38": {
    "type": "effect",
    "text": "One of the men reaches into a pocket... and produces a thin silver bracelet... The man explains that the insect bracelet has the power to kill even giant insects. After placing the bracelet on your wrist you leave the tavern and head north again.",
    "effects": { "add_items": ["Insect Bracelet"] },
    "next": "296"
  },
  "39": {
    "type": "choice",
    "text": "You open your backpack and pretend to search for the silver item. The Serpent Queen starts to fidget... You cannot think of a good plan and start to panic.",
    "choices": {
      "Run to the front door.": "32",
      "Draw your sword to attack her.": "249"
    }
  },
  "40": {
    "type": "choice",
    "text": "From the top of the wall you see that it encircles a group of brown creatures... You realize that these creatures are Bays playing their favourite game, Bays' Ball.",
    "choices": {
      "Ask to join in their game.": "168",
      "Climb back down the wall and head west.": "91"
    }
  },
  "41": {
    "type": "effect",
    "text": "The two guards holding you look at each other... they release their grip on you. As you pay him the 15 Gold Pieces he gives you a piercing look... you turn and walk into the city.",
    "effects": { "gold": -15 },
    "next": "74"
  },
  "42": {
    "type": "effect",
    "text": "You tell the man that you cannot pay the price... He shrugs his shoulders and says, 'Well, do you have any food?' You open your backpack and he takes all your remaining Provisions. He then starts to cast the silver arrow... Finally he presents you with it... You thank him... and leave his shop.",
    "effects": { "provisions": -99, "add_items": ["Silver Arrow"] },
    "next": "100"
  },
  "43": {
    "type": "effect",
    "text": "You cry out in pain as the goblet changes into a burning coal in your hand. You are badly burnt.",
    "effects": { "skill": -2, "luck": -2 },
    "next": "43_choice"
  },
  "43_choice": {
    "type": "choice",
    "text": "What will you do now?",
    "choices": {
      "Lift goblet A (if not done).": "175",
      "Lift goblet B (if not done).": "209",
      "Walk through the archway.": "107",
      "Climb the stairs.": "60"
    }
  },
  "44": {
    "type": "auto",
    "text": "Standing in a line across the street are three tall men each armed with a spiked club... They are vagabonds intent on robbing you.",
    "next": "44_condition"
  },
  "44_condition": {
    "type": "condition_item",
    "text": "Do you have a Throwing Knife?",
    "check": { "item": "Throwing Knife" },
    "outcomes": {
      "success": "18",
      "failure": "225"
    }
  },
  "45": {
    "type": "choice",
    "text": "The glass ball shatters on impact... the smoke turns a golden colour and begins to take the shape of a winged helmet... It is the most magnificent helmet you have ever seen.",
    "choices": {
      "Place it on your head.": "376",
      "Leave it alone and set off east again.": "161"
    }
  },
  "46": {
    "type": "effect",
    "text": "The blacksmith takes your money and walks over to some bales of hay... underneath it you see the chainmail coat... The coat fits perfectly and its workmanship is excellent. You leave the stables with your new armour and continue north.",
    "effects": { "skill": 2, "add_items": ["Chainmail Coat"] },
    "next": "115"
  },
  "47": {
    "type": "effect",
    "text": "The lightning bolt slams into your chest and knocks you to the floor.",
    "effects": { "stamina": -3 },
    "next": "47_skill_test"
  },
  "47_skill_test": {
    "type": "skill_test",
    "text": "If you are still alive you see the fat man roaring with laughter. Perhaps he is off his guard? You decide to throw your sword at him from your prone position. Roll two dice.",
    "outcomes": {
      "success": "313",
      "failure": "81"
    }
  },
  "48": {
    "type": "choice",
    "text": "There is an iron ladder secured to the rim of a hole, descending into a tunnel below. It is dark, and a very unpleasant smell rises up from below.",
    "choices": {
      "Climb down the ladder.": "321",
      "Replace the manhole cover and continue east.": "205"
    }
  },
  "49": {
    "type": "luck_test",
    "text": "As you draw your sword the guard leaps to his right and attempts to ring a small bell on the wall of the guardhouse. Test your Luck.",
    "outcomes": {
      "lucky": "10",
      "unlucky": "311"
    }
  },
  "50": {
    "type": "choice",
    "text": "The stairs lead down into the ship's cargo hold... Opposite you a corridor leads from the hold to two closed doors... From the door on your left you hear loud snoring. From the door on your right you hear nothing.",
    "choices": {
      "Open the door on the left.": "271",
      "Open the door on the right.": "232"
    }
  },
  "51": {
    "type": "choice",
    "text": "You walk over to the old man and help him to his feet. He is very grateful and offers to buy you a drink at a nearby tavern.",
    "choices": {
      "Go for a drink.": "325",
      "Continue your quest.": "348"
    }
  },
  "52": {
    "type": "shop",
    "text": "Behind the next stall is a young man selling small weapons and items of equipment. The prices of his wares are chalked up on a slate:",
    "items": {
      "Throwing Knife": 4,
      "Climbing Rope": 2,
      "Butcher's Meat Hook": 2,
      "Iron Spike": 1,
      "Lantern": 3
    },
    "next": "200"
  },
  "53": {
    "type": "auto",
    "text": "The silk curtains in front of the archway are pulled aside and a strange creature steps into the room... the Serpent Queen says, 'Don't try to fool me, I know that scoundrel Borryman never sends flowers. What silver gift have you brought me?'",
    "next": "53_condition"
  },
  "53_condition": {
    "type": "condition_item",
    "text": "Do you have a silver item to give her?",
    "check": { "item": "Silver" },
    "outcomes": {
      "success": "328",
      "failure": "39"
    }
  },
  "54": {
    "type": "effect",
    "text": "You search the guardhouse and find 2 Gold Pieces and a merchant's pass... Taking your findings with you, you creep outside... and walk into the city.",
    "effects": { "gold": 2, "add_items": ["Merchant's Pass"] },
    "next": "74"
  },
  "55": {
    "type": "effect",
    "text": "You dip the petals of the flower in the spilled blood of the dead dogs... On the floor are 10 Gold Pieces. You pick up the gold and walk back up the alleyway to Harbour Street.",
    "effects": { "gold": 10 },
    "next": "180"
  },
  "56": {
    "type": "game_over",
    "text": "There are over twenty guards coming to get you and it is useless to put up a fight... A few minutes later a hunchbacked jailer arrives... He fixes a ball and chain to your leg before leading you downstairs to begin your jail sentence. You have failed in your mission."
  },
  "57": {
    "type": "combat",
    "text": "The Dwarf jumps up off his stool, his face full of hatred... Wraggins points a finger at you, shouting 'Kill the friend of Nicodemus!' and the dogs leap at you, barking wildly. You must fight them for your life, one at a time.",
    "enemies": ["wolf_dog_1", "wolf_dog_2"],
    "outcomes": { "win": "360", "lose": "GAME_OVER" }
  },
  "58": {
    "type": "effect",
    "text": "As the carriage thunders by, the driver lashes out at you with his whip. You curse the driver... rubbing your neck where the whip has raised a weal. You set off west again.",
    "effects": { "stamina": -1 },
    "next": "171"
  },
  "59": {
    "type": "game_over",
    "text": "The Hag laughs as she watches you in the throes of your nightmare... You are helpless and unable to stop her plunging the dagger into your chest. Tonight her stew-pot will contain more than rat meat. Your adventure ends here."
  },
  "60": {
    "type": "choice",
    "text": "At the top of the stairs you reach a landing with two closed doors. As you are deciding which door to enter, you hear a noise from downstairs... a man's voice saying, 'Off you fly, my little beauty, find the intruder.'",
    "choices": {
      "Draw your sword in readiness.": "349",
      "Make a break for it and jump out of the window.": "192"
    }
  },
  "61": {
    "type": "auto",
    "text": "The silk curtains in front of the archway are pulled aside and a strange creature steps into the room... the Serpent Queen asks to see the flowers sent to her by Lord Azzur.",
    "next": "61_condition"
  },
  "61_condition": {
    "type": "condition_item",
    "text": "Do you have a bunch of flowers?",
    "check": { "item": "Bunch of Flowers" },
    "outcomes": {
      "success": "172",
      "failure": "350"
    }
  },
  "62": {
    "type": "choice",
    "text": "The old wooden doors open into a dingy, smoke-filled room... Not all the customers are human.",
    "choices": {
      "Walk to the bar to talk to the innkeeper.": "136",
      "Sit with three Dwarfs playing a dice game.": "173",
      "Sit with two Goblins who are arguing.": "22",
      "Sit with three men playing pin-finger.": "190",
      "Leave the tavern and walk north.": "296"
    }
  },
  "63": {
    "type": "effect",
    "text": "The Elf leads you into a room lit by purple candles... you drift off into a world of vivid dreams. While you are in this trance, the Elf takes two items and 5 Gold Pieces from your backpack (if you have them)... Outside you head east again.",
    "effects": { "gold": -5, "lose_random_items": 2 },
    "next": "280"
  },
  "64": {
    "type": "luck_test",
    "text": "You hear growls and loud barking... suddenly an enormous black wolf rushes out of the kennel straight at you. A long chain is attached to its collar and this may stop it from reaching you. Test your Luck.",
    "outcomes": {
      "lucky": "353",
      "unlucky": "64_effect"
    }
  },
  "64_effect": {
    "type": "effect",
    "text": "The chain remains slack and the wolf leaps up and bites your arm.",
    "effects": { "stamina": -1 },
    "next": "309"
  },
  "65": {
    "type": "choice",
    "text": "On the next floor there are two doors adjacent to one another... Suddenly a voice calls out... 'I am following your every move... Ha! Ha! Ha!'",
    "choices": {
      "Open the white door.": "319",
      "Open the black door.": "96",
      "Carry on up the stairs.": "197"
    }
  },
  "66": {
    "type": "transaction",
    "text": "The Dwarf smiles and boasts that he can make a key to open any lock in Port Blacksand. He says that his special keys are priced at 10 Gold Pieces each.",
    "choices": {
      "Buy a skeleton key for 10 Gold Pieces.": {
        "cost": 10,
        "effect": { "add_items": ["Skeleton Key"] },
        "next": "300"
      },
      "Leave the shop without buying a key.": { "cost": 0, "next": "300" }
    }
  },
  "67": {
    "type": "choice",
    "text": "The woman's voice sounds excited as she calls through the curtains, 'Oh, I wonder which kind dear has sent me flowers? Can you tell me who they are from?'",
    "choices": {
      "Tell her a name.": "195",
      "Tell her that you do not know who they are from.": "79"
    }
  },
  "68": {
    "type": "choice",
    "text": "The soup tastes absolutely disgusting.",
    "choices": {
      "Swallow it.": "380",
      "Spit it out.": "262"
    }
  },
  "69": {
    "type": "skill_test",
    "text": "Just as the guards are about to lead you away, you try with all your might to pull your arms from their grip. Roll two dice.",
    "outcomes": {
      "success": "355",
      "failure": "151"
    }
  },
  "70": {
    "type": "game_over",
    "text": "As you reach the chest it disappears before your eyes... You spin round but it's too late. Zanbar Bone's skeletal fingers are touching your flesh and are draining your life away. You are now one of his undead servants."
  },
  "71": {
    "type": "choice",
    "text": "The Ogre's room is full of clutter... you find a polished wooden box with a hand made of white shell inlaid on the lid. The box is locked...",
    "choices": {
      "Smash it open with your sword.": "324",
      "Leave the house without trying to open the box.": "282"
    }
  },
  "72": {
    "type": "combat",
    "text": "As you bend down to help the injured boy, he suddenly rolls over and you see the flashing blade of a dagger before your eyes. The boy is in fact a GOBLIN thief and you must fight him for your life.",
    "enemies": ["goblin_thief_1"],
    "outcomes": { "win": "208", "lose": "GAME_OVER" }
  },
  "73": {
    "type": "combat",
    "text": "You draw your sword and stand ready to fight the Trolls... Sourbelly snarls and says, 'Stand back, Fatnose - let me deal with this dog alone.' Fight them one at a time.",
    "enemies": ["troll_sourbelly", "troll_fatnose"],
    "rules": {
      "escape_after": { "enemy": "troll_sourbelly", "page": "239_escape" }
    },
    "outcomes": { "win": "110", "lose": "GAME_OVER" }
  },
  "239_escape": {
    "type": "effect",
    "text": "You escape after killing Sourbelly by throwing your shield at Fatnose and running off west along Mill Street.",
    "effects": { "skill": -1 },
    "next": "239"
  },
  "74": {
    "type": "choice",
    "text": "Through the main gates you see that the rubbish-filled streets of the port are narrow and cobbled. Old and decrepit buildings line them closely, with their upper storeys overhanging menacingly.",
    "choices": {
      "Go west down Key Street.": "95",
      "Head north along Market Street.": "116",
      "Go east down Clock Street.": "17"
    }
  },
  "75": {
    "type": "auto",
    "text": "Outside the rain has stopped and you set off north again.",
    "next": "31"
  },
  "76": {
    "type": "choice",
    "text": "To your left you see a large wooden barn set back from the houses. Two horses are tied to a post outside...",
    "choices": {
      "Walk through the barn doors.": "25",
      "Continue north.": "115"
    }
  },
  "77": {
    "type": "choice",
    "text": "You walk quietly back to the staircase and climb up to the second floor. Again there is a door at the end of the landing.",
    "choices": {
      "Open the door.": "292",
      "Climb up to the third floor.": "310"
    }
  },
  "78": {
    "type": "choice",
    "text": "The street runs north along the quayside for a few hundred metres before arriving at a junction.",
    "choices": {
      "Continue north up Harbour Street.": "256",
      "Walk east along Clog Street.": "216"
    }
  },
  "79": {
    "type": "effect",
    "text": "The silk curtains in front of the archway are suddenly pulled aside and a strange creature steps into the room... the SERPENT QUEEN challenges you... Suddenly the Serpent Queen stretches out her head and bites you on the neck.",
    "effects": { "stamina": -4, "skill": -1 },
    "next": "79_combat"
  },
  "79_combat": {
    "type": "combat",
    "text": "If you are still alive, you draw your sword to defend yourself.",
    "enemies": ["serpent_queen_1"],
    "outcomes": { "win": "295", "lose": "GAME_OVER" }
  },
  "80": {
    "type": "auto",
    "text": "The stairs lead into a small room, again painted red. Sitting at a table is a strange creature with a long snout and deep red, scaly skin... The creature looks up and stares at you.",
    "next": "80_condition"
  },
  "80_condition": {
    "type": "condition_item",
    "text": "Are you wearing a scorpion brooch?",
    "check": { "item": "Scorpion Brooch" },
    "outcomes": {
      "success": "392",
      "failure": "215"
    }
  },
  "81": {
    "type": "luck_test",
    "text": "The man laughs even louder... You decide to leap up and make a dash for the front door... The man sees what you are doing and fires another lightning bolt at you. Test your Luck.",
    "outcomes": {
      "lucky": "304",
      "unlucky": "243"
    }
  },
  "82": {
    "type": "effect",
    "text": "Before the Hag can complete her spell, you... gulp down the liquid... Safe from her evil, you draw your sword and step forward. You grab hold of her matted hair and cut a clump from her head... You throw the Hag into the sewer and walk back to the entrance hole.",
    "effects": {
      "remove_items": ["Potion of Mind Control"],
      "add_items": ["Hag's Hair"]
    },
    "next": "104"
  },
  "83": {
    "type": "random_effect",
    "text": "Fortunately, the contents of the jar are as the label reads, although the strength of the mixture is unpredictable. Roll 1 die. The number rolled is the number of STAMINA points that will be restored.",
    "dice_roll": "1d6",
    "effect_template": { "stamina": "{roll}" },
    "next": "83_choice"
  },
  "83_choice": {
    "type": "choice",
    "text": "What do you do now?",
    "choices": {
      "Continue searching the shop.": "322",
      "Leave the shop to head north.": "93"
    }
  },
  "84": {
    "type": "choice",
    "text": "The barrels all contain rotten fruit and the boxes contain manacles and leg irons... There is nothing else of interest to you on deck.",
    "choices": {
      "Walk to the deck cabin to climb down the stairs.": "50",
      "Leave the ship and walk north up Harbour Street.": "78"
    }
  },
  "85": {
    "type": "auto",
    "text": "You pay the silversmith and wait patiently while he makes a silver arrow for you. Finally he presents you with it... You thank him for his trouble and leave his shop.",
    "next": "100"
  },
  "86": {
    "type": "choice",
    "text": "A leather pouch hanging round the neck of the man contains a small glass ball containing what looks like swirling smoke.",
    "choices": {
      "Smash the ball on the ground.": "45",
      "Put the ball in your backpack.": "194",
      "Leave the ball behind and continue east.": "161"
    }
  },
  "87": {
    "type": "choice",
    "text": "You reach the top of the ladder and peer over the handrail to survey the ship's deck... one of the ship's crew stands on guard at the top of the gangplank... In the centre of the deck there is a small cabin with an open door.",
    "choices": {
      "Deal with the pirate on guard to inspect the boxes.": "120",
      "Creep along the deck to the stairs in the cabin.": "50"
    }
  },
  "88": {
    "type": "effect",
    "text": "You pull back the curtains... As you approach her she spins round and you are stunned to see... a large snake's head. It extends out from the shoulders and bites you on the neck.",
    "effects": { "stamina": -4, "skill": -1 },
    "next": "88_combat"
  },
  "88_combat": {
    "type": "combat",
    "text": "You are caught somewhat off-balance by the SERPENT QUEEN before you can draw your sword to defend yourself.",
    "enemies": ["serpent_queen_1"],
    "rules": {
      "escape_after_rounds": { "rounds": 3, "page": "333" }
    },
    "outcomes": { "win": "295", "lose": "GAME_OVER" }
  },
  "89": {
    "type": "effect",
    "text": "As you slide your hand into the glove, it seems to come alive... it becomes hot... Mercifully it cools down, but a thin white film remains on your hand, making it difficult to open and close. You curse and leave the house to head north.",
    "effects": { "skill": -2 },
    "next": "282"
  },
  "90": {
    "type": "choice",
    "text": "You swing your sword with all your strength... it bounces off. Before you have time to try again, you are surrounded by four town guards who are pointing their pikes at you.",
    "choices": {
      "Tell them you have caught the escaped prisoner.": "199",
      "Offer them a bribe to let you and the prisoner go.": "187"
    }
  },
  "91": {
    "type": "choice",
    "text": "You pass a beggar in the street. He is sitting in the gutter and holds an empty tin in his hand.",
    "choices": {
      "Toss a Gold Piece into his tin.": "332",
      "Walk past him.": "124"
    }
  },
  "92": {
    "type": "effect",
    "text": "You are slowly feeling your way along the bricks when your hand comes into contact with a smooth flat object. You pull it out and see that you are holding a mirror. You pack it away and walk back to the entrance hole.",
    "effects": { "add_items": ["Mirror"] },
    "next": "174"
  },
  "93": {
    "type": "choice",
    "text": "On the right-hand side of the street you see a tavern called the Spotted Dog.",
    "choices": {
      "Enter the tavern.": "62",
      "Continue north.": "296"
    }
  },
  "94": {
    "type": "effect",
    "text": "The little man smiles... He reaches into his pocket and produces some sparkling dust which he throws up at you. As it settles on your clothes, a feeling of strength surges through your body.",
    "effects": { "stamina": 6 },
    "next": "94_auto"
  },
  "94_auto": {
    "type": "auto",
    "text": "He then tells you that as he is feeling particularly grateful he will grant you another wish. With your strength returned you feel you can now deal with Zanbar Bone and ask the little man of his whereabouts.",
    "next": "234"
  },
  "95": {
    "type": "choice",
    "text": "On the left side of the street you see a large iron key hanging over the doorway of a small shop. A sign in the window reads 'J. B. Wraggins, Locksmith'.",
    "choices": {
      "Enter the shop.": "224",
      "Continue walking west.": "300"
    }
  },
  "96": {
    "type": "choice",
    "text": "You open the door and enter a room which is adorned with macabre objects and paintings. A black cat is sitting in front of a table... On the table lies an open chest containing a golden skull.",
    "choices": {
      "Walk over to the chest.": "257",
      "Close the door and open the white door.": "319",
      "Close the door and walk back up the stairs.": "197"
    }
  },
  "97": {
    "type": "effect",
    "text": "You decide to take a quick look inside the kennel. Hanging on a hook is an iron key which you place in your pocket.",
    "effects": { "luck": 1, "add_items": ["Iron Key"] },
    "next": "353"
  },
  "98": {
    "type": "effect",
    "text": "You uncork the bottle with your teeth and take a long gulp of the liquid. Fortunately the liquid is what the man claims it to be. Well-refreshed, you set off east again, bidding the old man farewell.",
    "effects": { "gold": -2, "stamina": 3, "luck": 1 },
    "next": "363"
  },
  "99": {
    "type": "combat",
    "text": "You are unable to explain why you are in Port Blacksand and the guards draw their swords, telling you that you are under arrest. You draw your sword and fight them one at a time.",
    "enemies": ["city_guard_4", "city_guard_5"],
    "outcomes": { "win": "285", "lose": "GAME_OVER" }
  },
  "100": {
    "type": "choice",
    "text": "You soon arrive at a junction.",
    "choices": {
      "Turn north into Tower Street.": "127",
      "Continue east into Stable Street.": "246"
    }
  },
  "101": {
    "type": "choice",
    "text": "You enter the shop and see the Man-Orc standing behind the counter. He is smiling at your misfortune and says, 'Huh, can't even take Old Trollborn. And don't think I am going to give you your money back.'",
    "choices": {
      "Attack the impudent Man-Orc.": "5",
      "Leave the shop and head north again, containing your anger.": "93"
    }
  },
  "102": {
    "type": "effect",
    "text": "The other two vagabonds stop to aid their friend, but it is too late... They pick up their dead friend and carry him off down a narrow alleyway... You walk quickly north before they have time to reappear.",
    "effects": { "remove_items": ["Throwing Knife"] },
    "next": "372"
  },
  "103": {
    "type": "auto",
    "text": "You arrive at a four-way junction. The street continuing east changes its name to Clock Street and the street running north and south is called Market Street. Looking north you see a crowd of people walking up the street cheering... You decide to follow them.",
    "next": "148"
  },
  "104": {
    "type": "choice",
    "text": "Back at the entrance hole...",
    "choices": {
      "Climb up the ladder to the street to continue east.": "205",
      "Walk south along the sewer (if not done so).": "118"
    }
  },
  "105": {
    "type": "choice",
    "text": "Most of the houses in the street are joined in a long terrace, but you see one on the left side that stands alone... There appears to be a large wooden kennel outside the heavy oak front door.",
    "choices": {
      "Approach the front door.": "64",
      "Keep walking north.": "304"
    }
  },
  "106": {
    "type": "effect",
    "text": "The Lantern breaks on impact with the Mummy and covers it with burning oil. Flames spread quickly... the Mummy is soon consumed by fire.",
    "effects": { "remove_items": ["Lantern"] },
    "next": "106_choice"
  },
  "106_choice": {
    "type": "choice",
    "text": "What will you do now?",
    "choices": {
      "Inspect the open sarcophagus.": "163",
      "Leave the room immediately.": "231"
    }
  },
  "107": {
    "type": "choice",
    "text": "The back room is as lavishly furnished as the front room. In the far corner you see a wooden chest bolted to the floor. It is securely locked.",
    "choices": {
      "Try to pick the lock.": "128",
      "Leave the room and climb the stairs to the floor above.": "60"
    }
  },
  "108": {
    "type": "auto",
    "text": "You lower yourself slowly to the ground. Above you the guards are waving their fists... You are now outside Port Blacksand.",
    "next": "108_condition"
  },
  "108_condition": {
    "type": "condition_multi",
    "text": "Do you have all the necessary items required to slay the Night Prince, and have you been tattooed?",
    "checks": [
      { "type": "item", "value": "Hag's Hair" },
      { "type": "item", "value": "Black Pearls" },
      { "type": "item", "value": "Lotus Flower" },
      { "type": "item", "value": "Unicorn Tattoo" }
    ],
    "outcomes": {
      "success": "201",
      "failure": "299"
    }
  },
  "109": {
    "type": "auto",
    "text": "The guards look at each other and burst out laughing... 'Let's hear no more about bribes, it's the dungeon for you.'",
    "effects": { "gold": -5 },
    "next": "151"
  },
  "110": {
    "type": "auto",
    "text": "Your fight attracted a group of onlookers... one sly-looking character sloped off with the obvious intention of finding more guards. It is dangerous to stay here any longer, so you run off west along Mill Street.",
    "next": "239"
  },
  "111": {
    "type": "effect",
    "text": "You cut the pouch from round the pirate's neck and open it. Inside you find six black pearls. Add 2 Luck points.",
    "effects": { "luck": 2, "add_items": ["Six Black Pearls"] },
    "next": "111_choice"
  },
  "111_choice": {
    "type": "choice",
    "text": "You leave the room with your valuable treasure. Outside in the corridor...",
    "choices": {
      "Open the other door (if you have not done so).": "232",
      "Leave the ship and walk north up Harbour Street.": "78"
    }
  },
  "112": {
    "type": "choice",
    "text": "While most of the houses in the street are small, cramped and dark, you see one ahead that stands alone and is painted bright red. The door has a 'Welcome' sign hanging from it.",
    "choices": {
      "Enter the house.": "154",
      "Prefer to keep walking north.": "334"
    }
  },
  "113": {
    "type": "choice",
    "text": "You enter the house and find yourself standing in a room full of toys... On seeing you the women both start to shout, 'Give us toys! Give us toys!'",
    "choices": {
      "Give them something from your backpack.": "141_effect",
      "Leave these strange old ladies and continue east.": "375"
    }
  },
  "114": {
    "type": "effect",
    "text": "There are three bejewelled rings under the counter and 13 Gold Pieces in a drawer. Take what you will and leave the shop to continue west.",
    "effects": {
      "gold": 13,
      "add_items": ["Bejewelled Ring", "Bejewelled Ring", "Bejewelled Ring"]
    },
    "next": "196"
  },
  "115": {
    "type": "choice",
    "text": "Coming towards you... is a man in tattered rags with a ball and chain attached to his leg. He is exhausted... 'Please cut me free. The town guards are not far behind me.' Farther up the street you hear shouting voices and then armed men come into view.",
    "choices": {
      "Cut through his chains with your sword.": "90",
      "Hand him over to the town guards.": "274"
    }
  },
  "116": {
    "type": "choice",
    "text": "Walking north along the street you see the entrance to a small herbalist's shop to your left... There is an 'Open' sign on the door but the shop is empty.",
    "choices": {
      "Enter the shop.": "250",
      "Continue walking north up Market Street.": "93"
    }
  },
  "117": {
    "type": "choice",
    "text": "At the end of the market, a street named Bridge Street runs north... It starts to rain... The door to one derelict house flaps noisily in the wind.",
    "choices": {
      "Take refuge in the derelict house until the rain stops.": "188",
      "Press on ahead.": "31"
    }
  },
  "118": {
    "type": "auto",
    "text": "You can hear some scratching sounds... you recognize it as a Giant Centipede.",
    "next": "118_condition"
  },
  "118_condition": {
    "type": "condition_item",
    "text": "Do you possess an insect bracelet?",
    "check": { "item": "Insect Bracelet" },
    "outcomes": { "success": "2", "failure": "166" }
  },
  "119": {
    "type": "transaction",
    "text": "The small boy smiles and thrusts a tin mug into your hand. He tells you the barrel contains sparkling water which cures ills, wounds and diseases. To fill the mug costs 3 Gold Pieces.",
    "choices": {
      "Drink the water for 3 Gold Pieces.": { "cost": 3, "next": "233" },
      "Keep your gold and walk north.": { "cost": 0, "next": "247" }
    }
  },
  "120": {
    "type": "luck_test",
    "text": "You pick up a piece of wood and run as quietly as possible over to the pirate to try to knock him unconscious. Test your Luck.",
    "outcomes": {
      "lucky": "84",
      "unlucky": "152"
    }
  },
  "121": {
    "type": "effect",
    "text": "The Ogre gulps down the food in no time at all.",
    "effects": { "provisions": -2 },
    "next": "121_choice"
  },
  "121_choice": {
    "type": "choice",
    "text": "Licking his lips, he turns to you and tells you to get out of his home.",
    "choices": {
      "Obey the ungrateful Ogre, and leave.": "282",
      "Draw your sword to teach him a lesson.": "140"
    }
  },
  "122": {
    "type": "choice",
    "text": "The room you enter is full of debris and rotting food. Standing in the middle of all the mess are two men wearing tattered clothing... On seeing you, they pick up wooden sticks and advance towards you.",
    "choices": {
      "Back out of the room and shut them in.": "277",
      "Attack them.": "361"
    }
  },
  "123": {
    "type": "effect",
    "text": "Inside a box on a wooden shelf you find 3 Gold Pieces and an iron key. On examining it you realize that it is a very special key. It is a skeleton key... Add 1 LUCK point and leave the shop to head west.",
    "effects": { "gold": 3, "luck": 1, "add_items": ["Skeleton Key"] },
    "next": "300"
  },
  "124": {
    "type": "choice",
    "text": "A narrow alleyway runs south off the street between two houses.",
    "choices": {
      "Walk down the alleyway.": "326",
      "Continue along Harbour Street.": "180"
    }
  },
  "125": {
    "type": "effect",
    "text": "This shield is cursed by Zanbar Bone... Lose 1 SKILL point. Unable to rid yourself of this handicap, you walk over to the spiral staircase and climb up it.",
    "effects": { "skill": -1, "add_items": ["Cursed Tower Shield"] },
    "next": "21"
  },
  "126": {
    "type": "special_heal",
    "text": "The little girl grabs hold of your arm... an old man... takes hold of an arrow protruding from your arm and gently pulls it free... The wound... disappears... You may restore 2 STAMINA points for each arrow pulled free by the old man. Then... he tells you that he wants the broadsword... you feel obliged to give him your sword... In exchange he gives you an ordinary fighting sword. Reduce your SKILL score by 1.",
    "heal_per_arrow": 2,
    "effects": {
      "skill": -1,
      "remove_items": ["Broadsword"],
      "add_items": ["Fighting Sword"]
    },
    "next": "112"
  },
  "127": {
    "type": "choice",
    "text": "Just ahead of you, three men are involved in a fight - the two younger men appear to be attacking an older man with iron bars.",
    "choices": {
      "Help the old man.": "177",
      "Avoid the brawling men and continue north.": "348"
    }
  },
  "128": {
    "type": "luck_test_double",
    "text": "As you try to turn the lock with a piece of bent wire... Two tiny panels in the chest flick open to expose two needle darts which shoot out at you. Test your Luck twice, once for each dart.",
    "outcomes": {
      "lucky_lucky": "340",
      "lucky_unlucky": "149",
      "unlucky_lucky": "149",
      "unlucky_unlucky": "19"
    }
  },
  "129": {
    "type": "game_over",
    "text": "You step back from the vile body of Zanbar Bone, waiting for him to decay. However, you have chosen wrongly! ...His skeletal fingers are draining your life away, and soon you will begin your undead existence as a servant of Zanbar Bone."
  },
  "130": {
    "type": "combat",
    "text": "As the guard slumps to the ground, two more armed men appear from a stone guardhouse by the gate, obviously attracted by the noise of your battle. There is no time to run so you must fight them one at a time.",
    "enemies": ["city_guard_6", "city_guard_7"],
    "outcomes": { "win": "74", "lose": "GAME_OVER" }
  },
  "131": {
    "type": "choice",
    "text": "You walk into a room with sparse furnishings... a woman's voice calls out 'Who is it?'",
    "choices": {
      "Tell her you are delivering flowers.": "67",
      "Tell her you have come to collect old rags.": "6",
      "Tell her you are a tax collector.": "179"
    }
  },
  "132": {
    "type": "effect",
    "text": "The creature pins the silver brooch to your leather tunic and you pay the price demanded. You have bought an item with healing properties. After surviving any battle, the brooch will immediately restore 1 STAMINA point... Pleased with your purchase, you leave the house and head north.",
    "effects": { "add_items": ["Silver Scorpion Brooch (Healing)"] },
    "next": "334"
  },
  "133": {
    "type": "choice",
    "text": "The street ends at a junction with Mill Street... Looking east you see a group of town guards... and you decide to walk quickly west... On your left you see a narrow lane and ahead you see a young lad coming towards you pushing a barrow laden with fruit.",
    "choices": {
      "Walk down the lane.": "182",
      "Buy some fruit from the barrow-boy.": "160"
    }
  },
  "134": {
    "type": "effect",
    "text": "You wake up feeling dazed, with a large lump on your head. Your backpack lies open by your side and you are annoyed to discover that all your gold has been stolen. Those thieving Dwarfs! You stand up and set off west down the street.",
    "effects": { "gold": "set_to_0" },
    "next": "396"
  },
  "135": {
    "type": "choice",
    "text": "When you draw your sword the man cries out and runs into a back room... He warns you that the egg contains a deadly gas and he will throw it at you. He also threatens to swallow the key to his silver cupboard.",
    "choices": {
      "Still wish to attack him.": "229",
      "Run out of the shop and go further up Clog Street.": "100"
    }
  },
  "136": {
    "type": "choice",
    "text": "You walk over to the bar and order a drink. The old innkeeper scowls and tells you that he doesn't serve people from out of town. He pulls a dagger from his belt... and tells you to leave.",
    "choices": {
      "Fight the innkeeper.": "270",
      "Leave the tavern and head north.": "296"
    }
  },
  "137": {
    "type": "random_effect",
    "text": "As you take your first step forwards you are alarmed to hear the familiar whistle of arrows... They are coming from windows on either side of the street. Roll one die. This is the number of arrows that will hit you and each will cause you to lose 3 STAMINA points.",
    "dice_roll": "1d6",
    "effect_template": { "stamina": "-{roll}*3" },
    "next": "137_effect"
  },
  "137_effect": {
    "type": "effect",
    "text": "If you are still alive, you lose 2 LUCK points.",
    "effects": { "luck": -2 },
    "next": "327"
  },
  "138": {
    "type": "condition_combat",
    "text": "After the battle...",
    "check": { "last_enemy_fought": "ape_man_1" },
    "outcomes": {
      "success": "312",
      "failure": "283"
    }
  },
  "139": {
    "type": "choice",
    "text": "Walking along the street you are suddenly halted by a plant pot smashing on to the cobblestones in front of you... The door to the house is open.",
    "choices": {
      "Enter the house to find out what the argument is about.": "113",
      "Ignore the argument and continue east.": "375"
    }
  },
  "140": {
    "type": "combat",
    "text": "The OGRE looks unimpressed by your aggressive action and, picking up a large bone as a weapon, lumbers towards you.",
    "enemies": ["ogre_1"],
    "rules": {
      "escape_after_rounds": { "rounds": 3, "page": "282" }
    },
    "outcomes": { "win": "71", "lose": "GAME_OVER" }
  },
  "141_effect": {
    "type": "effect",
    "text": "You give the women an item from your backpack.",
    "effects": { "lose_random_items": 1 },
    "next": "141"
  },
  "141": {
    "type": "choice",
    "text": "The women immediately start arguing again over your gift... You look around the room and see a table set for a meal. There are two bowls of hot soup...",
    "choices": {
      "Pick up a wooden spoon and drink some of the soup.": "68",
      "Leave the old ladies and continue east.": "375"
    }
  },
  "142": {
    "type": "game_over",
    "text": "The crossbow bolt has a poisoned tip. You stagger back... The poison spreads through your body quickly and you sink into a deep sleep from which you will not awaken."
  },
  "143": {
    "type": "choice",
    "text": "When you hear the guards coming down the stairs, you lie on the floor and start to groan. They unlock the cell door and enter.",
    "choices": {
      "Continue with your feigned illness and tell them you have the plague.": "306",
      "Fight them unarmed.": "157"
    }
  },
  "144": {
    "type": "combat",
    "text": "The Hag screams as your sword cuts deep into her arm. Her concentration is lost and the spell is broken... From out of her clothing the Hag pulls a dagger with a long shimmering blade. You are eager to fight her.",
    "enemies": ["hag_1"],
    "outcomes": { "win": "303", "lose": "GAME_OVER" }
  },
  "145": {
    "type": "choice",
    "text": "Inside the shop an old woman... smiles, saying, 'Good afternoon, my name is Mrs Pipe. Can I interest you in one of my special flowers?'",
    "choices": {
      "See what she has to offer.": "293",
      "Leave the shop and head west.": "24"
    }
  },
  "146": {
    "type": "auto",
    "text": "You walk back into the shop. You try to open the glass cupboard but it is locked. Inside you see two silver goblets, a silver chalice and a silver spoon.",
    "next": "146_condition"
  },
  "146_condition": {
    "type": "condition_item",
    "text": "Do you have a skeleton key?",
    "check": { "item": "Skeleton Key" },
    "outcomes": { "success": "220", "failure": "388" }
  },
  "147": {
    "type": "effect",
    "text": "A search through the leather bags of the thieves produces 16 Gold Pieces and a glass phial containing a green liquid.",
    "effects": { "gold": 16 },
    "next": "147_choice"
  },
  "147_choice": {
    "type": "choice",
    "text": "You have found a glass phial.",
    "choices": {
      "Drink the liquid.": "338",
      "Just take the gold and press on northwards.": "105"
    }
  },
  "148": {
    "type": "effect",
    "text": "As you catch up with the chanting crowd... an old woman standing next to you offers you two eggs to throw... But as you do so, the old woman picks your pocket without you noticing.",
    "effects": { "lose_gold_or_item": 1 },
    "next": "287"
  },
  "149": {
    "type": "effect",
    "text": "The dart is poison-tipped. Lose 2 STAMINA points.",
    "effects": { "stamina": -2 },
    "next": "149_choice"
  },
  "149_choice": {
    "type": "choice",
    "text": "If you are still alive, what will you do?",
    "choices": {
      "Continue picking the lock.": "340",
      "Leave the room and climb the stairs.": "60"
    }
  },
  "150": {
    "type": "choice",
    "text": "The Troll bursts out laughing and says, 'Fooled you! There isn't a Pepper Street in Port Blacksand!'... He offers you a choice. You can pay a fine of all the gold in your backpack and be thrown out of the city, or spend a year... in a dirty dungeon cell.",
    "choices": {
      "Pay the fine and be thrown out.": "367",
      "Resist arrest.": "73"
    }
  },
  "151": {
    "type": "transaction",
    "text": "The two guards lead you... downstairs to the cells... an old man gets up... and starts to speak... 'Do you want me to set you free? Give me 10 Gold Pieces and I'll have you out in five minutes.'",
    "choices": {
      "Give the old man 10 Gold Pieces.": { "cost": 10, "next": "351" },
      "Ignore the old man.": { "cost": 0, "next": "29" }
    }
  },
  "152": {
    "type": "combat",
    "text": "The PIRATE draws his cutlass. As he approaches, his toothless grin unnerves you a little. You do not have time to draw your sword and must fight the pirate with the wooden stick.",
    "enemies": ["pirate_1"],
    "rules": { "player_attack_modifier": -2 },
    "outcomes": { "win": "20", "lose": "GAME_OVER" }
  },
  "153": {
    "type": "auto",
    "text": "Holding the golden owl in your hand, you are able to see into the pitch-black room. Just in time, you see the trip-wire... and the large crossbow... There is nothing else in the room. You decide to walk back to the staircase to climb up to the next floor.",
    "next": "65"
  },
  "154": {
    "type": "choice",
    "text": "Inside the house you find yourself in a room painted red... on a table... are two glass bowls. In one there is a small golden scorpion and in the other lies a silver scorpion...",
    "choices": {
      "Pick up the golden scorpion.": "273",
      "Pick up the silver scorpion.": "13",
      "Climb the stairs.": "80",
      "Leave the house and head north.": "334"
    }
  },
  "155": {
    "type": "effect",
    "text": "You are trampled underfoot by one of the horses. Lose 3 STAMINA points. If you are still alive, you stand up... The carriage races out of view and you set off west again...",
    "effects": { "stamina": -3 },
    "next": "171"
  },
  "156": {
    "type": "auto",
    "text": "...the Trolls march you along Mill Street until you reach the city's North Gate... They give you a forceful boot up the backside and you land sprawling on the dusty road outside.",
    "next": "156_condition"
  },
  "156_condition": {
    "type": "condition_multi",
    "text": "Do you have all the items required to slay the Night Prince, and have you been tattooed?",
    "checks": [
      { "type": "item", "value": "Hag's Hair" },
      { "type": "item", "value": "Black Pearls" },
      { "type": "item", "value": "Lotus Flower" },
      { "type": "item", "value": "Unicorn Tattoo" }
    ],
    "outcomes": { "success": "201", "failure": "299" }
  },
  "157": {
    "type": "combat",
    "text": "You leap up and punch the first guard. He staggers back and draws his sword. You fight them one at a time in the small cell.",
    "enemies": ["city_guard_8", "city_guard_9"],
    "rules": { "player_attack_modifier": -3 },
    "outcomes": { "win": "54", "lose": "GAME_OVER" }
  },
  "158": {
    "type": "choice",
    "text": "You must react quickly to escape the advancing Suit of Armour.",
    "choices": {
      "Open the door in front of you.": "122",
      "Run back to the staircase and climb up to the next floor.": "207"
    }
  },
  "159": {
    "type": "choice",
    "text": "The owner of the house is obviously quite wealthy... An archway leads into a back room and stairs to your right lead up to another floor.",
    "choices": {
      "Search the room you are in.": "278",
      "Walk through the archway.": "107",
      "Climb the stairs.": "60"
    }
  },
  "160": {
    "type": "transaction",
    "text": "The boy puts down his barrow and asks you what you would like to buy. He recommends his plums as being particularly refreshing.",
    "choices": {
      "Pay 1 Gold Piece for a bag of plums.": { "cost": 1, "next": "211" },
      "Buy a bag of red apples for 1 Gold Piece.": { "cost": 1, "next": "242" }
    }
  },
  "161": {
    "type": "choice",
    "text": "The street makes a sudden left turn and continues north... you notice that round the corner the houses are much bigger... On the left side of the street you see that a door to one of the houses is open.",
    "choices": {
      "Enter the house.": "245",
      "Keep going northwards.": "282"
    }
  },
  "162": {
    "type": "luck_test",
    "text": "You creep up to the pirate and try to cut the pouch loose. Test your Luck.",
    "outcomes": {
      "lucky": "7",
      "unlucky": "226"
    }
  },
  "163": {
    "type": "effect",
    "text": "The sarcophagus contains a gold ring which has an eye etched into its top. You have found the long-lost Ring of the Golden Eye, fabled for its ability to allow its wearer to detect illusions. Add 2 LUCK points and leave the room.",
    "effects": { "luck": 2, "add_items": ["Ring of the Golden Eye"] },
    "next": "231"
  },
  "164": {
    "type": "auto",
    "text": "You stagger forward beyond the angle of fire of the unseen archers... Slowly and painfully you pull the arrows from your body. After bandaging your wounds you rise to your feet and continue north.",
    "next": "112"
  },
  "165": {
    "type": "choice",
    "text": "You leave the room of skulls.",
    "choices": {
      "Turn right down Candle Street.": "139",
      "Walk back to the junction and go down Harbour Street.": "91"
    }
  },
  "166": {
    "type": "combat",
    "text": "You will have to swing your sword with all your might to pierce the armour-like shell of this monster.",
    "enemies": ["giant_centipede_1"],
    "outcomes": { "win": "272", "lose": "GAME_OVER" }
  },
  "167": {
    "type": "effect",
    "text": "When you have paid the Man-Orc the 4 Gold Pieces, he explains that placing the herbs on a wound will help to heal it. Unfortunately the strength of the mixture varies. When required, roll 1 die. The number rolled is the number of STAMINA points that will be restored. Somewhat surprised at your good fortune you leave the shop and walk north. Add 1 LUCK point.",
    "effects": { "gold": -4, "luck": 1, "add_items": ["Healing Herbs (1d6)"] },
    "next": "93"
  },
  "168": {
    "type": "skill_test",
    "text": "The Bays hand you a wooden stick and tell you that if you hit the ball over the wall, you will win the game for them. Roll two dice.",
    "outcomes": { "success": "359", "failure": "266" }
  },
  "169": {
    "type": "transaction",
    "text": "The blacksmith... inquires if you are interested in buying a chainmail coat. They are not cheap.",
    "choices": {
      "Pay 20 Gold Pieces for a chainmail coat.": { "cost": 20, "next": "46" },
      "Leave the stables without buying a coat.": { "cost": 0, "next": "115" }
    }
  },
  "170": {
    "type": "combat",
    "text": "The man sees you drawing your sword and snatches his battle-axe off the wall. He walks around the counter to fight you.",
    "enemies": ["jeweller_1"],
    "rules": {
      "escape_unconditional": "196"
    },
    "outcomes": { "win": "114", "lose": "GAME_OVER" }
  },
  "171": {
    "type": "choice",
    "text": "The street gradually starts to run downhill. The houses end at a tavern called the Black Lobster and the street opens out on to a quayside... tied to it is an old galleon.",
    "choices": {
      "Walk down the jetty to climb on board the ship.": "399",
      "Walk north up Harbour Street.": "78"
    }
  },
  "172": {
    "type": "effect",
    "text": "You take the bunch of flowers out of your backpack and hand it to the Serpent Queen. She thanks you and hands you a tip of 2 Gold Pieces before showing you to the front door. Outside you set off north along Stable Street.",
    "effects": { "remove_items": ["Bunch of Flowers"], "gold": 2 },
    "next": "333"
  },
  "173": {
    "type": "choice",
    "text": "The three old bearded Dwarfs are so involved with their game that they pay you no attention... Finally, one turns to you and asks if you would like to join in their game.",
    "choices": {
      "Gamble some of your Gold Pieces.": "206",
      "Leave the smoky tavern and walk north.": "296"
    }
  },
  "174": {
    "type": "choice",
    "text": "Back at the entrance hole...",
    "choices": {
      "Climb up the ladder to the street to continue east.": "205",
      "Walk north along the sewer (if not done so).": "356"
    }
  },
  "175": {
    "type": "luck_test",
    "text": "Slowly lifting the goblet, you are surprised to see a yellow scorpion underneath. It darts forward and tries to sting you. Test your Luck.",
    "outcomes": { "lucky": "204", "unlucky": "373" }
  },

  "176": {
    "type": "choice",
    "text": "You tell the worried bather that you will not harm him... He says, '...I do know where you can get a silver arrow. Ben Borryman the silversmith will make anything in silver at a price. You will find him in Clog Street.'... you leave the shivering captain alone in his room, locking the door behind you.",
    "choices": {
      "Open the other door (if you have not done so already).": "271",
      "Leave the ship and walk north up Harbour Street.": "78"
    }
  },
  "177": {
    "type": "combat",
    "text": "You draw your sword and rush to help the old man... two men... turn and attack you. Fight them one at a time.",
    "enemies": ["robber_1", "robber_2"],
    "outcomes": { "win": "51", "lose": "GAME_OVER" }
  },
  "178": {
    "type": "choice",
    "text": "The archway leads into a large room in the centre of which crouches a human-like creature... you recognize the distinguishing marks of an Ogre.",
    "choices": {
      "Attempt to speak with him.": "264",
      "Attack him with your sword.": "140",
      "Leave the house to head north.": "282"
    }
  },
  "179": {
    "type": "choice",
    "text": "The silk curtains in front of the archway are pulled aside and a brown leather bag flies out and lands in front of you, making a dull jingling sound.",
    "choices": {
      "Open the bag.": "16",
      "Leave the house without opening the bag and continue north.": "333"
    }
  },
  "180": {
    "type": "choice",
    "text": "Ahead you hear the noisy clatter of galloping hooves... Someone is rapidly approaching in a horse-drawn carriage.",
    "choices": {
      "See who it is.": "344",
      "Hide out of sight behind a barrel.": "34"
    }
  },
  "181": {
    "type": "auto",
    "text": "The key fits the lock and the handle turns.",
    "next": "159"
  },
  "182": {
    "type": "transaction",
    "text": "...a fat man... says, 'Practise what you preach!' You tell him that you require a yellow sun to be tattooed on your forehead with a white unicorn in the centre of it. He replies that it is a simple task but it will cost you 10 Gold Pieces.",
    "choices": {
      "Pay his high price.": { "cost": 10, "next": "279" },
      "Say you cannot afford it.": { "cost": 0, "next": "354" }
    }
  },
  "183": {
    "type": "choice",
    "text": "You are told that smoking mixture and a pipe costs 1 Gold Piece, and healing mixture costs 4 Gold Pieces per portion.",
    "choices": {
      "Buy some smoking mixture.": "366_transact",
      "Buy some healing mixture.": "167_transact",
      "Leave the shop and head north.": "93"
    }
  },
  "184": {
    "type": "auto",
    "text": "After defeating the dogs...",
    "next": "184_condition"
  },
  "184_condition": {
    "type": "condition_item",
    "text": "Do you have any of Mrs Pipe's golden flowers?",
    "check": { "item": "Golden Flower" },
    "outcomes": { "success": "55", "failure": "308" }
  },
  "185": {
    "type": "choice",
    "text": "The suit of armour breaks up as it crashes on to the floor. It is no threat to you.",
    "choices": {
      "Open the door in front of you.": "122",
      "Walk back to the staircase and climb up to the next floor.": "207"
    }
  },
  "186": {
    "type": "choice",
    "text": "On top of the Lizardine's table you find 4 Gold Pieces and a scorpion brooch made of copper.",
    "choices": {
      "Pick up the brooch and pin it to your tunic.": "387_effect",
      "Just take the gold and leave.": "186_gold_only"
    }
  },
  "186_gold_only": {
    "type": "effect",
    "effects": { "gold": 4 },
    "next": "334"
  },
  "187": {
    "type": "auto",
    "text": "You tell the town guards that you have something special for them... They say they are interested in any of the following items: magic armour, magic rings or magic potions.",
    "next": "187_condition"
  },
  "187_condition": {
    "type": "condition_item_any",
    "text": "Do you have any of the required items to bribe them?",
    "checks": [
      { "item": "Magic Armour" },
      { "item": "Magic Ring" },
      { "item": "Magic Potion" }
    ],
    "outcomes": { "success": "260", "failure": "341" }
  },
  "188": {
    "type": "choice",
    "text": "It is gloomy in the house... you find a broken chair and slump down in it to rest. Suddenly you notice something slither across the floor... you are encircled by six snakes.",
    "choices": {
      "Hack at them with your sword.": "253",
      "Make a dash for the door.": "15"
    }
  },
  "189": {
    "type": "effect",
    "text": "You take aim... and fire the arrow at the Spirit Stalker. The arrow plunges into its chest... Finally it is still, and you retrieve your silver arrow. You see that you are in a beautiful marble-floored hallway...",
    "effects": {},
    "next": "189_choice"
  },

  "189_choice": {
    "type": "choice",
    "text": "...on the far wall hang two iron shields. The crest on one is a tower, and on the other a unicorn. A spiral staircase leads up...",
    "choices": {
      "Take the shield with the tower crest.": "125",
      "Take the shield with the unicorn crest.": "374",
      "Climb the spiral staircase.": "21"
    }
  },
  "190": {
    "type": "skill_test",
    "text": "Sitting down at the table the men invite you to join in their game of pin-finger... If you manage not to stab yourself they will give you a magic item. If you do stab yourself you must give them 5 Gold Pieces. Roll two dice.",
    "outcomes": {
      "success": "38",
      "failure": "190_fail"
    }
  },
  "190_fail": {
    "type": "effect",
    "text": "You are unable to control the fast movement of the dagger and stab one of your fingers. You toss 5 Gold Pieces on the table and stand up to leave the tavern. Outside you head north again.",
    "effects": { "gold": -5 },
    "next": "296"
  },
  "191": {
    "type": "combat",
    "text": "You draw your sword to defend yourself against the advancing LEAF BEASTS. They all attack you at once, seemingly trying to crush and smother you. Treat the Leaf Beasts as a single creature.",
    "enemies": ["leaf_beasts_1"],
    "outcomes": { "win": "133", "lose": "GAME_OVER" }
  },
  "192": {
    "type": "luck_test",
    "text": "It is a drop of some five metres to the ground and you land heavily. Test your Luck.",
    "outcomes": {
      "lucky": "304",
      "unlucky": "192_fail"
    }
  },
  "192_fail": {
    "type": "effect",
    "text": "You twist your sword arm badly. Lose 1 SKILL point. Once again, you head north.",
    "effects": { "skill": -1 },
    "next": "304"
  },
  "193": {
    "type": "auto",
    "text": "You must face the Mummy.",
    "next": "193_condition"
  },
  "193_condition": {
    "type": "condition_item",
    "text": "If you have a Ring of Fire, it will be the best weapon against the Mummy. Otherwise you must use your sword.",
    "check": { "item": "Ring of Fire" },
    "outcomes": {
      "success": "286",
      "failure": "193_combat"
    }
  },
  "193_combat": {
    "type": "combat",
    "text": "You must use your sword.",
    "enemies": ["mummy_1"],
    "outcomes": { "win": "163", "lose": "GAME_OVER" }
  },
  "194": {
    "type": "effect",
    "text": "The smoke in the glass ball appears to vanish as you place it carefully in your backpack. Feeling slightly uneasy about your new treasure you set off east again.",
    "effects": { "add_items": ["Empty Glass Ball"] },
    "next": "161"
  },
  "195": {
    "type": "choice",
    "text": "Which person will you say sent the flowers?",
    "choices": {
      "Lord Azzur.": "61",
      "Mrs Pipe.": "268",
      "Ben Borryman.": "53"
    }
  },
  "196": {
    "type": "auto",
    "text": "You arrive at a four-way junction... The street continuing west changes its name to Key Street... Looking north you see a crowd of people walking up the street cheering... You decide to follow them.",
    "next": "148"
  },
  "197": {
    "type": "choice",
    "text": "On the next landing there is a door with a black tower carved in ebony attached to it. There is also a black suit of armour standing outside the door.",
    "choices": {
      "Inspect the suit of armour.": "301",
      "Open the door.": "122",
      "Carry on up the stairs.": "207"
    }
  },
  "198": {
    "type": "effect",
    "text": "You look around at the rest of the crowd but they remain seated... You search through the dirty clothing of the Goblins and find 9 Gold Pieces and a small carved ivory skull on a silver chain. You take your findings and leave the tavern to head north.",
    "effects": { "gold": 9, "add_items": ["Ivory Skull Necklace"] },
    "next": "296"
  },
  "199": {
    "type": "effect",
    "text": "You tell the town guards that you are a bounty hunter... The chief guard walks over to you and hands you 5 Gold Pieces, saying, 'Here's your reward.'... You decide to head quickly north...",
    "effects": { "gold": 5 },
    "next": "222"
  },
  "200": {
    "type": "choice",
    "text": "In the next stall area there is a small, brightly coloured tent. Attached to it is a small sign which reads, 'Madame Star, Clairvoyant'.",
    "choices": {
      "Enter the tent.": "394",
      "Continue north.": "117"
    }
  },
  "201": {
    "type": "effect",
    "text": "Following Nicodemus's map, you start your long walk north... As the light fades you decide to camp under a huge elm tree... (add 2 STAMINA points). In the morning you look around for a yew tree and cut a long branch from it with which you make a bow...",
    "effects": { "stamina": 2, "add_items": ["Yew Bow"] },
    "next": "201_choice"
  },
  "201_choice": {
    "type": "choice",
    "text": "A white dove delivers a message: Nicodemus has misinformed you. You must use only two of the three ingredients to kill Zanbar Bone. You must choose which two to grind together.",
    "choices": {
      "Hag's Hair and Black Pearls": "201_wander",
      "Hag's Hair and Lotus Flower": "201_wander",
      "Black Pearls and Lotus Flower": "201_wander"
    }
  },
  "201_wander": {
    "type": "random_encounter",
    "text": "You set off again, but it is not long before your surroundings become less welcoming... a wandering monster has been attracted by your scent. Roll one die to see what creature has appeared.",
    "encounters": {
      "1": "wandering_orc",
      "2": "wandering_giant_snake",
      "3": "wandering_wolf",
      "4": "wandering_pygmy",
      "5": "wandering_ape_man",
      "6": "wandering_cave_troll"
    },
    "outcomes": { "win": "138", "lose": "GAME_OVER" }
  },
  "202": {
    "type": "choice",
    "text": "The guard replies that he will send for an escort... Almost immediately two other guards come running out... and grab hold of one of your arms. The guard with the pike laughs... 'Guards, take this fool away to be shackled...'",
    "choices": {
      "Allow yourself to be taken away.": "151",
      "Attempt to fight the guards.": "69",
      "Try to bribe the guards.": "276"
    }
  },
  "203": {
    "type": "luck_test",
    "text": "Zanbar Bone walks towards you... You throw down your sword and notch the silver arrow to your bow. You have only one chance. You take aim and release the bow-string. Test your Luck.",
    "outcomes": {
      "lucky": "244",
      "unlucky": "GAME_OVER"
    }
  },
  "204": {
    "type": "choice",
    "text": "You drop the goblet and pull your hand away. The scorpion scurries a metre across the floor before you step on it with your boot.",
    "choices": {
      "Lift goblet B (if not done so).": "209",
      "Lift goblet C (if not done so).": "43",
      "Walk through the archway.": "107",
      "Climb the stairs.": "60"
    }
  },
  "205": {
    "type": "choice",
    "text": "After replacing the manhole cover you set off east again. Everything seems a little too quiet... Ahead you see that Stable Street turns sharply to the left.",
    "choices": {
      "Walk round the corner.": "44",
      "Walk back to the junction and turn right into Tower Street.": "127"
    }
  },
  "206": {
    "type": "dice_game",
    "text": "The Dwarf explains that they are playing a simple winner-takes-all dice game. The stakes are 2 Gold Pieces... The person rolling the highest number collects the 8 Gold Pieces... You may play four times.",
    "rules": {
      "stake": 2,
      "opponents": 3,
      "max_plays": 4
    },
    "next": "296"
  },
  "207": {
    "type": "combat",
    "text": "The staircase ends at a door... You walk outside on to the flat roof of the tower. Suddenly... you look up to see two large DEATH HAWKS... swooping down on you. Fight them one at a time.",
    "enemies": ["death_hawk_1", "death_hawk_2"],
    "outcomes": { "win": "314", "lose": "GAME_OVER" }
  },
  "208": {
    "type": "choice",
    "text": "The Goblin's pockets contain 2 Gold Pieces, a clove of garlic and some old knucklebones. Take what you wish and head east again along Clog Street.",
    "choices": {
      "Take all items.": "208_effect_all",
      "Take only gold and garlic.": "208_effect_some",
      "Take only gold.": "208_effect_gold",
      "Leave everything.": "317"
    }
  },
  "208_effect_all": {
    "type": "effect",
    "effects": { "gold": 2, "add_items": ["Garlic", "Knucklebones"] },
    "next": "317"
  },
  "208_effect_some": {
    "type": "effect",
    "effects": { "gold": 2, "add_items": ["Garlic"] },
    "next": "317"
  },
  "208_effect_gold": {
    "type": "effect",
    "effects": { "gold": 2 },
    "next": "317"
  },
  "209": {
    "type": "effect",
    "text": "Underneath the goblet lies a small pile of Gold Pieces. You count 12 in all and put them in your backpack.",
    "effects": { "gold": 12 },
    "next": "209_choice"
  },
  "209_choice": {
    "type": "choice",
    "text": "If you are not interested in the other goblets, you may move on.",
    "choices": {
      "Lift goblet A (if not done).": "175",
      "Lift goblet C (if not done).": "43",
      "Walk through the archway.": "107",
      "Climb the stairs.": "60"
    }
  },
  "210": {
    "type": "game_over",
    "text": "Her gaze is so hypnotic that you are unable to look away... she embraces you and slowly sinks her fangs into your neck... when you awake you are unaware of your previous existence - you have become a Vampire yourself!"
  },
  "211": {
    "type": "effect",
    "text": "The plums are sweet and juicy and taste delicious. You wipe your mouth with the back of your hand and continue west.",
    "effects": { "stamina": 1 },
    "next": "307"
  },
  "212": {
    "type": "auto",
    "text": "You are relieved that the noise of your fight did not attract any more guards, but not wishing to tempt providence you dash into the city.",
    "next": "74"
  },
  "213": {
    "type": "choice",
    "text": "A man wearing a white apron is sitting at a bench busily polishing a silver goblet. There are several silver objects in a glass cupboard...",
    "choices": {
      "Talk to the silversmith.": "248",
      "Attack him with your sword.": "135",
      "Leave the shop and continue east.": "100"
    }
  },
  "214": {
    "type": "luck_test",
    "text": "As soon as you touch the battle-axe, the Suit of Armour starts to move... it swings the battle-axe in an attempt to strike you. Test your Luck.",
    "outcomes": { "lucky": "158", "unlucky": "379" }
  },
  "215": {
    "type": "choice",
    "text": "The lizard-like creature starts to speak... asking whether you would like to buy one of its famous scorpion brooches.",
    "choices": {
      "Buy one.": "315",
      "Refuse politely and leave.": "334"
    }
  },
  "216": {
    "type": "choice",
    "text": "Clog Street is very narrow... To your left you see what looks like a small boy lying face down on the cobblestones, groaning loudly.",
    "choices": {
      "Stop to help.": "72",
      "Walk on.": "317"
    }
  },
  "217": {
    "type": "combat",
    "text": "You walk all day until you reach the hill... upon which the Night Prince's tower stands... Suddenly you hear a shrill howl... They belong to MOON DOGS, Zanbar Bone's trained killer hounds. Fight them one at a time.",
    "enemies": ["moon_dog_1", "moon_dog_2"],
    "outcomes": { "win": "259", "lose": "GAME_OVER" }
  },
  "218": {
    "type": "auto",
    "text": "The Dwarf smiles and extends his arm... 'An enemy of Nicodemus is a friend of mine.' He explains that the wizard lives alone in a small hut under Singing Bridge... You thank the Dwarf for his information and leave...",
    "next": "300"
  },
  "219": {
    "type": "choice",
    "text": "The larger of the two Trolls... looks at the pass and says, 'You don't look much like a merchant to me. Are you one of those fancy folk who have been attending the spice sales in Pepper Street?'",
    "choices": {
      "Answer 'Yes'.": "150",
      "Answer 'No'.": "393"
    }
  },
  "220": {
    "type": "effect",
    "text": "The key fits the lock securing the grill enclosing the glass cupboard. It clicks open and you are able to take any of the items you wish. You find nothing else of interest in the shop, so you walk outside and continue east.",
    "effects": {
      "add_items": ["Silver Goblets", "Silver Chalice", "Silver Spoon"]
    },
    "next": "100"
  },
  "221": {
    "type": "effect",
    "text": "The alley is narrow and dark... suddenly a large net falls on you from above... you watch helplessly as they rummage through your backpack. They seem interested only in your gold... You have lost all your gold. Lose 2 LUCK points. Returning to the street, you turn left and head west.",
    "effects": { "gold": "set_to_0", "luck": -2 },
    "next": "396"
  },
  "222": {
    "type": "transaction",
    "text": "On the right-hand side the houses are separated from the street by a wooden fence... a sign reading: 'Public Gardens. Entry Fee 1 Gold Piece'.",
    "choices": {
      "Go into the gardens.": { "cost": 1, "next": "370" },
      "Keep on walking.": { "cost": 0, "next": "133" }
    }
  },
  "223": {
    "type": "random_test",
    "text": "Sweat breaks out on your forehead - you choose a pill and swallow it. Roll one die.",
    "dice_roll": "1d6",
    "outcomes": {
      "1": "GAME_OVER",
      "2-6": "223_success"
    }
  },
  "223_success": {
    "type": "effect",
    "text": "You have chosen a harmless pill. The man reaches into a pouch... and hands you 20 Gold Pieces. He then bids you farewell... You leave the room and walk back up the alley.",
    "effects": { "gold": 20 },
    "next": "165"
  },
  "224": {
    "type": "choice",
    "text": "Sitting on a stool at the back of the shop is an old bespectacled Dwarf... Finally the machine comes to a halt and the Dwarf asks you what you want.",
    "choices": {
      "Ask if he has any skeleton keys for sale.": "66",
      "Ask him if he knows where Nicodemus lives.": "236"
    }
  },
  "225": {
    "type": "combat",
    "text": "Each VAGABOND boasts that he can kill you single-handed. They decide to fight you one at a time.",
    "enemies": ["vagabond_1", "vagabond_2", "vagabond_3"],
    "outcomes": { "win": "397", "lose": "GAME_OVER" }
  },
  "226": {
    "type": "combat",
    "text": "You manage to break free from the pirate's grip and draw your sword. You step backwards towards the door as the PIRATES leap from their bunks to grab their cutlasses. The room is cramped and you fight them one at a time.",
    "enemies": ["pirate_2", "pirate_3", "pirate_4"],
    "rules": { "escape_unconditional": "78" },
    "outcomes": { "win": "111", "lose": "GAME_OVER" }
  },
  "227": {
    "type": "choice",
    "text": "The street soon makes another sharp turn to the right... Outside one of the houses to your left is a pile of rubbish... On top of the pile is a pair of old boots that look about your size.",
    "choices": {
      "Try them on.": "362",
      "Keep walking east.": "103"
    }
  },
  "228": {
    "type": "auto",
    "text": "The key fits the lock, which clicks open as you turn it. You open the door and enter a beautiful marble-floored hallway.",
    "next": "189_choice"
  },
  "229": {
    "type": "luck_test",
    "text": "As you advance towards him the man swallows the key and throws the egg at you. Test your Luck.",
    "outcomes": { "lucky": "23", "unlucky": "343" }
  },
  "230": {
    "type": "effect",
    "text": "You scratch around in the cracks in the wall and find a loose stone... Peering into the hole you see an iron key. You place it in the lock of your cell and are amazed to feel it turn. Add 1 Luck point.",
    "effects": { "luck": 1 },
    "next": "230_combat"
  },
  "230_combat": {
    "type": "combat",
    "text": "You leave your cell and pick up your sword... the GUARDS rush down the stairs and are surprised to see you waiting for them, sword drawn. You fight them one at a time.",
    "enemies": ["city_guard_8", "city_guard_9"],
    "outcomes": { "win": "54", "lose": "GAME_OVER" }
  },
  "231": {
    "type": "choice",
    "text": "Outside on the landing...",
    "choices": {
      "Enter the black door.": "96",
      "Walk back to the stairs to climb up to the next floor.": "197"
    }
  },
  "232": {
    "type": "choice",
    "text": "The door opens into a small room, in the centre of which stands a steaming tub of hot water.",
    "choices": {
      "Hide behind the door inside the room to see who is about to take a bath.": "12",
      "Close the door.": "383"
    }
  },
  "233": {
    "type": "effect",
    "text": "The sparkling water is refreshing but not as medicinal as the small boy claimed. Add 1 STAMINA point to your total. You shake your fist at the boy in mock anger, and set off north.",
    "effects": { "stamina": 1 },
    "next": "247"
  },
  "234": {
    "type": "auto",
    "text": "The tiny man smiles... 'He's on the fourth floor in the room with the black door.' Then he waves his arms at you and disappears in a small puff of smoke... You breathe in deeply and turn the handle of the black door.",
    "next": "96"
  },
  "235": {
    "type": "auto",
    "text": "You decide not to risk any further possible danger to yourself and crawl out of the room. You stand up, walk over to the staircase and climb up to the next floor.",
    "next": "65"
  },
  "236": {
    "type": "choice",
    "text": "Your question produces a suspicious look on the face of the Dwarf... 'I know Nicodemus but what do you want of him?'",
    "choices": {
      "Tell him you are on a mission from Silverton and need his help.": "57",
      "Tell him that you want to kill Nicodemus.": "218"
    }
  },
  "237": {
    "type": "effect",
    "text": "You rub the jewel in the ring and point it at the Leaf Beasts. A blast of fire shoots out... You seize your opportunity and dash through their broken defence... and make your escape into Stable Street.",
    "effects": {
      "add_items": ["Lotus Flower"],
      "remove_items": ["Ring of Fire"]
    },
    "next": "133"
  },
  "238": {
    "type": "choice",
    "text": "On the right side of the street you see a small alleyway... The alley soon ends at a doorway with six skulls painted on it...",
    "choices": {
      "Walk down the alley and open the door.": "27",
      "Continue east.": "139"
    }
  },
  "239": {
    "type": "auto",
    "text": "Behind you comes the sound of running feet... a boy runs out of a house and shouts, 'Follow me!'... You climb into a cart and cover yourself with hay... About half an hour later the cart stops... You poke your head out... and are surprised to see that you are on the edge of a wood.",
    "next": "108_condition"
  },
  "240": {
    "type": "effect",
    "text": "The man hands you the gold and puts the gems under the counter.",
    "effects": { "gold": 9 },
    "next": "240_choice"
  },
  "240_choice": {
    "type": "choice",
    "text": "What do you do now?",
    "choices": {
      "Inquire about the price of his rings.": "36",
      "Leave the shop and head west.": "196"
    }
  },
  "241": {
    "type": "shop_multi",
    "text": "Inside the shop you see... an Elf... He tells you that all his coloured candles cost 1 Gold Piece each. You may buy as many as you wish.",
    "items": {
      "Red Candle": 1,
      "Blue Candle": 1,
      "Green Candle": 1,
      "Yellow Candle": 1
    },
    "next": "241_choice"
  },
  "241_choice": {
    "type": "choice",
    "text": "He then asks you if you would like to see one of his magic candles in the back room.",
    "choices": {
      "See one of his magic candles.": "63",
      "Leave the shop and head east.": "280"
    }
  },
  "242": {
    "type": "effect",
    "text": "The boy hurriedly picks up his barrow... You eat an apple but it is sour... Lose 1 STAMINA point. You throw the other apples away and continue west.",
    "effects": { "stamina": -1 },
    "next": "307"
  },
  "243": {
    "type": "effect",
    "text": "You have suffered a terrible burn. Lose 5 STAMINA points. If you are still alive, you decide to lie still and feign death... In considerable pain, you crawl along the floor to the door... Hauling yourself to your feet you stagger off up the street.",
    "effects": { "stamina": -5 },
    "next": "304"
  },
  "244": {
    "type": "choice",
    "text": "The Night Prince is paralysed, but not for long. He can summon unearthly powers to defend himself, and you must act quickly. What compound will you rub into his eyes?",
    "choices": {
      "Hag's hair and black pearls.": "9",
      "Black pearls and lotus flower.": "129",
      "Lotus flower and Hag's hair.": "337"
    }
  },
  "245": {
    "type": "choice",
    "text": "You enter a large room with brown walls and a straw-covered floor... A high archway leads through the room to the back of the house, from where you hear a low murmuring voice.",
    "choices": {
      "Walk through the archway.": "178",
      "Leave the house and continue north.": "282"
    }
  },
  "246": {
    "type": "transaction",
    "text": "As you walk warily down the narrow cobbled street, you are suddenly confronted by a little old man... He smiles and asks if you would like to pay 2 Gold Pieces for a drink of his wonderful healing potion.",
    "choices": {
      "Pay for a drink.": { "cost": 2, "next": "98" },
      "Keep going east.": { "cost": 0, "next": "363" }
    }
  },
  "247": {
    "type": "luck_test",
    "text": "The street makes a sharp turn to the left... Turning the corner, you are suddenly jumped on by three short, stocky assailants... Two grab your legs and one tries to knock you out with a cudgel. Test your Luck.",
    "outcomes": { "lucky": "384", "unlucky": "134" }
  },
  "248": {
    "type": "choice",
    "text": "You ask Ben Borryman if he has any silver arrows for sale. He replies that he does not, but will make one for you at a cost of 10 Gold Pieces or two magic items.",
    "choices": {
      "Pay 10 Gold Pieces.": "248_pay_gold",
      "Pay with two magic items.": "248_pay_items",
      "Say you cannot afford the price.": "42"
    }
  },
  "248_pay_gold": {
    "type": "effect",
    "effects": { "gold": -10, "add_items": ["Silver Arrow"] },
    "next": "85"
  },
  "248_pay_items": {
    "type": "effect",
    "effects": { "lose_magic_items": 2, "add_items": ["Silver Arrow"] },
    "next": "85"
  },
  "249": {
    "type": "combat",
    "text": "The Serpent Queen's head darts about you very quickly as she tries to bite you with her poisonous fangs. She will be difficult to defeat.",
    "enemies": ["serpent_queen_1"],
    "outcomes": { "win": "295", "lose": "GAME_OVER" }
  },
  "250": {
    "type": "choice",
    "text": "A small bell rings... a creature... half man, half orc... stands behind the counter. A sharp hand-axe hangs from his belt...",
    "choices": {
      "Inquire about the herbs.": "183",
      "Ask if the Man-Orc knows of Nicodemus.": "342",
      "Attack the Man-Orc.": "5"
    }
  },
  "251": {
    "type": "luck_test",
    "text": "One of the small people stops and looks down at you... he points a short crossbow at you and fires a bolt. Test your Luck.",
    "outcomes": { "lucky": "269", "unlucky": "330" }
  },
  "252": {
    "type": "luck_test",
    "text": "The carriage is not going to stop! Suddenly the four horses... are almost on top of you. You must dive to one side to avoid being run down. Test your Luck.",
    "outcomes": { "lucky": "275", "unlucky": "155" }
  },
  "253": {
    "type": "combat",
    "text": "The SNAKES are not very tough opponents... however, each Attack Round that they inflict a wound on you, 4 points must be subtracted from your STAMINA score because of their poisonous bite.",
    "enemies": ["snakes_1"],
    "rules": { "enemy_extra_damage": 2 },
    "outcomes": { "win": "75", "lose": "GAME_OVER" }
  },
  "254": {
    "type": "effect",
    "text": "A horrified look spreads across the Vampire's face when she sees the clove of garlic... You back out of the room... and lock it from the outside. You then run over to the staircase and climb the stairs to the next floor.",
    "effects": { "remove_items": ["Garlic"] },
    "next": "310"
  },
  "255": {
    "type": "auto",
    "text": "The guards eye you suspiciously but let you walk on after seeing your pass. You walk on quickly north.",
    "next": "227"
  },
  "256": {
    "type": "choice",
    "text": "The houses on the right-hand side of the street are small and weather-beaten. Old women sit outside on the front steps cleaning fish... The street and the quayside come to an end at a great iron anchor. You turn round and walk back towards the junction.",
    "choices": {
      "Stop to talk with the women.": "320",
      "Ignore them and walk straight back to the junction.": "369"
    }
  },
  "257": {
    "type": "condition_item",
    "text": "As you walk towards the chest...",
    "check": { "item": "Ring of the Golden Eye" },
    "outcomes": { "success": "385", "failure": "70" }
  },
  "258": {
    "type": "auto",
    "text": "Stepping over the Fire Imp, you walk back to the stairs... When you reach the bottom you are somewhat surprised to see a fat man, richly dressed... He raises his right hand in the air and from his outstretched fingers shoot ragged white bolts of lightning.",
    "next": "258_condition"
  },
  "258_condition": {
    "type": "condition_item",
    "text": "Are you wearing an ivory skull around your neck?",
    "check": { "item": "Ivory Skull Necklace" },
    "outcomes": { "success": "318", "failure": "47" }
  },
  "259": {
    "type": "auto",
    "text": "You wipe the blood from your sword and walk to the wooden door. You try the handle, but it is locked.",
    "next": "259_condition"
  },
  "259_condition": {
    "type": "condition_item",
    "text": "Do you have a skeleton key?",
    "check": { "item": "Skeleton Key" },
    "outcomes": {
      "success": "228",
      "failure": "259_choice"
    }
  },
  "259_choice": {
    "type": "choice",
    "text": "What will you do?",
    "choices": {
      "Pull on a cord hanging in front of the door.": "4",
      "Charge the door open with your shoulder.": "365"
    }
  },
  "260": {
    "type": "effect",
    "text": "The guards take their bribe and let you go. As you walk north you hear the angry shouts of the captured murderer behind you. You hurry on...",
    "effects": { "lose_magic_item_bribe": 1 },
    "next": "222"
  },
  "261": {
    "type": "effect",
    "text": "You buy the guard's advice. He says 'This city is ruled by Lord Azzur... if you are found without a pass, you are as good as dead...' He then makes a sweeping gesture... and you walk past him into the city.",
    "effects": { "gold": -3 },
    "next": "74"
  },
  "262": {
    "type": "auto",
    "text": "Wiping the foul-tasting soup from your lips with the back of your hand, you storm out of the house... Once outside you set off east again.",
    "next": "375"
  },
  "263": {
    "type": "auto",
    "text": "Despite the light from the burning lanterns on the landing, you are unable to see anything inside the room; it is completely black.",
    "next": "263_condition"
  },
  "263_condition": {
    "type": "condition_item",
    "text": "Do you have a golden owl?",
    "check": { "item": "Golden Owl" },
    "outcomes": { "success": "153", "failure": "281" }
  },
  "264": {
    "type": "transaction",
    "text": "Before you are able to speak a word, the Ogre's voice booms out, saying, 'Somebody has stolen all my food. Will you give me some of yours?'",
    "choices": {
      "Give the Ogre 2 Provisions.": { "cost": 0, "next": "121" },
      "Refuse his request.": { "cost": 0, "next": "357" }
    }
  },
  "265": {
    "type": "auto",
    "text": "With your sword still dripping with the blood of the Rats you walk further along the tunnel... the silence is suddenly shattered... Coming straight at you... is a white-haired old woman dressed in rags. She is a Hag.",
    "next": "265_condition"
  },
  "265_condition": {
    "type": "condition_item",
    "text": "Do you possess a Potion of Mind Control?",
    "check": { "item": "Potion of Mind Control" },
    "outcomes": { "success": "82", "failure": "390" }
  },
  "266": {
    "type": "effect",
    "text": "The Bays on your side are angry with you for losing the match... everyone in the arena seems to have pushed you around. Lose two items from your backpack. Eventually you climb back over the wall...",
    "effects": { "lose_random_items": 2 },
    "next": "91"
  },
  "267": {
    "type": "effect",
    "text": "The guards release their grip on you. As you pay him the 10 Gold Pieces he gives you a piercing look... '...as for Nicodemus, find him yourself.' Suppressing an urge to draw your sword, you turn and walk into the city.",
    "effects": { "gold": -10 },
    "next": "74"
  },
  "268": {
    "type": "choice",
    "text": "The Serpent Queen starts to accuse you, shouting, 'I ordered no flowers from Mrs Pipe... What trickery is this, rogue?' You start to panic...",
    "choices": {
      "Run to the front door.": "32",
      "Draw your sword to attack her.": "249"
    }
  },
  "269": {
    "type": "auto",
    "text": "The little man with the crossbow curses before running into the building on your left. There does not appear to be an easy way to catch him, so you walk under the bridge and continue east.",
    "next": "30"
  },
  "270": {
    "type": "combat",
    "text": "As you draw your sword the innkeeper lets out a loud whistle. A trap-door behind the bar flies open and... a large green TROLL emerges from a cellar... You are forced to fight.",
    "enemies": ["troll_1"],
    "outcomes": { "win": "26", "lose": "GAME_OVER" }
  },
  "271": {
    "type": "choice",
    "text": "Asleep in their bunks are three pirates... You see that one of the pirates is wearing a small leather pouch around his neck.",
    "choices": {
      "Creep up and try to cut it loose.": "162",
      "Close the door again, and not take any risks.": "284"
    }
  },
  "272": {
    "type": "choice",
    "text": "You manage to squeeze yourself between the dead Centipede and the roof of the tunnel. You walk further down the tunnel and see that it ends at an iron grill...",
    "choices": {
      "Try to remove the grill.": "377",
      "Walk back to the entrance hole.": "174"
    }
  },
  "273": {
    "type": "effect",
    "text": "Inspecting the scorpion you see that it is a brooch. You decide to pin it to your leather tunic. It is a lucky charm. Add 2 Luck points to your total.",
    "effects": { "luck": 2, "add_items": ["Golden Scorpion Brooch (Lucky)"] },
    "next": "273_choice"
  },
  "273_choice": {
    "type": "choice",
    "text": "What will you do next?",
    "choices": {
      "Pick up the silver scorpion (if not done).": "13",
      "Climb the stairs.": "80",
      "Leave the house and head north.": "334"
    }
  },
  "274": {
    "type": "effect",
    "text": "The guards are pleased that you have caught their wanted man... The chief guard hands you 5 Gold Pieces, saying, 'Here's your reward.'... you continue north along Stable Street.",
    "effects": { "gold": 5 },
    "next": "222"
  },
  "275": {
    "type": "auto",
    "text": "You stand up and brush yourself down, thinking that you would like to meet this Lord Azzur another day. The carriage races out of view and you set off west again.",
    "next": "171"
  },
  "276": {
    "type": "choice",
    "text": "You tell the guards that you will make it worth their while if they release you... How much will you offer them?",
    "choices": {
      "Five Gold Pieces.": "109",
      "Ten Gold Pieces.": "267",
      "Fifteen Gold Pieces.": "41"
    }
  },
  "277": {
    "type": "auto",
    "text": "You walk quickly over to the staircase and climb up to the next floor.",
    "next": "207"
  },
  "278": {
    "type": "choice",
    "text": "Although many of the items in the room are extremely valuable, they are not of much use... On a mahogany card table lie three upturned silver goblets.",
    "choices": {
      "Pick up goblet A.": "175",
      "Pick up goblet B.": "209",
      "Pick up goblet C.": "43",
      "Walk through the archway.": "107",
      "Climb the stairs.": "60"
    }
  },
  "279": {
    "type": "effect",
    "text": "He takes the money and motions you to sit down... After a long and painful process... he applies the indelible inks. You look in a mirror... and find your new appearance somewhat strange... you walk back up the lane and turn left into Mill Street.",
    "effects": { "add_items": ["Unicorn Tattoo"] },
    "next": "307"
  },
  "280": {
    "type": "choice",
    "text": "Further along the street on the left is another shop. A sign outside reads 'Ben Borryman, Silversmith'.",
    "choices": {
      "Enter the shop.": "213",
      "Keep going east.": "100"
    }
  },
  "281": {
    "type": "choice",
    "text": "The room is pitch black.",
    "choices": {
      "Grope your way into the room.": "391",
      "Walk back to the staircase to climb to the next floor.": "65"
    }
  },
  "282": {
    "type": "choice",
    "text": "On the right-hand side of the street you see a large wooden barrel and a small boy sitting beside it on a stool.",
    "choices": {
      "Talk to the boy.": "119",
      "Keep walking north.": "247"
    }
  },
  "283": {
    "type": "auto",
    "text": "There is nothing useful to be found on the dead creature, so you decide to press on northwards.",
    "next": "217"
  },
  "284": {
    "type": "choice",
    "text": "What do you do now?",
    "choices": {
      "Open the other door (if not done so).": "232",
      "Leave the ship and walk north up Harbour Street.": "78"
    }
  },
  "285": {
    "type": "effect",
    "text": "You make a rapid search through the guards' possessions and find 7 Gold Pieces, a set of keys and a piece of stale bread. Make a note of what you wish to keep and set off north again.",
    "effects": { "gold": 7, "add_items": ["Set of Keys", "Stale Bread"] },
    "next": "227"
  },
  "286": {
    "type": "effect",
    "text": "You point the ring at the advancing Mummy and rub the jewel. A jet of fire flies out... and the Mummy is consumed by flames... in a few moments there is nothing left but a few charred fragments.",
    "effects": { "remove_items": ["Ring of Fire"] },
    "next": "163"
  },
  "287": {
    "type": "transaction",
    "text": "The food stalls are selling fruit, vegetables, meat and hot soup... Walking north along the west side of the square you see a man dressed in purple velvet playing a lyre.",
    "choices": {
      "Eat some hot food for 1 Gold Piece.": { "cost": 1, "next": "287_eat" },
      "Stop and listen to the musician.": { "cost": 0, "next": "3" },
      "Walk past the musician.": { "cost": 0, "next": "398" }
    }
  },
  "287_eat": {
    "type": "effect",
    "text": "The food is hearty and restores some of your strength.",
    "effects": { "stamina": 2 },
    "next": "3"
  },
  "288": {
    "type": "game_over",
    "text": "Nobody spends a night asleep at Zanbar Bone's tower and lives. In the middle of the night a jet of gas... poisons you almost immediately... Then Zanbar Bone's witches and servants raise you into an undead world..."
  },
  "289": {
    "type": "effect",
    "text": "The Man-Orc takes your Gold Piece... and finally says, 'I know nothing about him.'",
    "effects": { "gold": -1 },
    "next": "289_choice"
  },
  "289_choice": {
    "type": "choice",
    "text": "What do you do now?",
    "choices": {
      "Fight the impudent Man-Orc.": "5",
      "Contain your anger and leave.": "93"
    }
  },
  "290": {
    "type": "auto",
    "text": "You try to walk nonchalantly past the Trolls, but they suspect something odd about you and call you over... The Trolls laugh scornfully and ask to see your pass.",
    "next": "290_condition"
  },
  "290_condition": {
    "type": "condition_item",
    "text": "Do you have a merchant's pass?",
    "check": { "item": "Merchant's Pass" },
    "outcomes": { "success": "219", "failure": "335" }
  },
  "291": {
    "type": "luck_test",
    "text": "As the guard realizes what you are doing he thrusts his pike at you. Test your Luck.",
    "outcomes": { "lucky": "74", "unlucky": "291_fail" }
  },
  "291_fail": {
    "type": "effect",
    "text": "The pike pierces your arm. Lose 2 STAMINA points.",
    "effects": { "stamina": -2 },
    "next": "10"
  },
  "292": {
    "type": "auto",
    "text": "You walk into a lavishly furnished room... Standing before you is a young woman... when she smiles again, you see two fang-like teeth which can only belong to a Vampire.",
    "next": "292_condition"
  },
  "292_condition": {
    "type": "condition_item",
    "text": "Do you have some garlic?",
    "check": { "item": "Garlic" },
    "outcomes": { "success": "254", "failure": "210" }
  },
  "293": {
    "type": "choice",
    "text": "She explains that she has just picked one of her golden flowers... Mrs Pipe asks for any magic item, piece of armour or food (two portions of your Provisions) in exchange for the golden flower.",
    "choices": {
      "Trade a magic item.": "293_trade_magic",
      "Trade armour.": "293_trade_armour",
      "Trade 2 Provisions.": "293_trade_food",
      "Do not trade and leave.": "24"
    }
  },
  "293_trade_magic": {
    "type": "effect",
    "effects": { "lose_magic_item_trade": 1, "add_items": ["Golden Flower"] },
    "next": "24"
  },
  "293_trade_armour": {
    "type": "effect",
    "effects": {
      "remove_items": ["Leather Armour"],
      "add_items": ["Golden Flower"]
    },
    "next": "24"
  },
  "293_trade_food": {
    "type": "effect",
    "effects": { "provisions": -2, "add_items": ["Golden Flower"] },
    "next": "24"
  },
  "294": {
    "type": "choice",
    "text": "At the top of the gangplank stands one of the ship's crew. On seeing you he draws his cutlass and tells you to get off the ship.",
    "choices": {
      "Walk back down the gangplank.": "78",
      "Draw your sword to deal with this pirate.": "386"
    }
  },
  "295": {
    "type": "effect",
    "text": "You sheathe your sword and start to search the Serpent Queen's house... you find 12 Gold Pieces. Add 1 LUCK point. You leave the house and continue your walk along Stable Street.",
    "effects": { "gold": 12, "luck": 1 },
    "next": "333"
  },
  "296": {
    "type": "combat",
    "text": "Walking towards you down the street are two men wearing black robes... On seeing you they nod at each other and draw their swords; they are THIEVES... Fight them one at a time.",
    "enemies": ["thief_1", "thief_2"],
    "outcomes": { "win": "147", "lose": "GAME_OVER" }
  },
  "297": {
    "type": "auto",
    "text": "There is nothing of use to you in the room. The smell of the Zombies and the debris is terrible, so you decide to leave immediately. You walk back to the staircase to climb up to the next floor.",
    "next": "207"
  },
  "298": {
    "type": "effect",
    "text": "You feel the effects of poison creeping through your body. Lose 4 STAMINA points. If you are still alive you manage to reach the door to escape.",
    "effects": { "stamina": -4 },
    "next": "75"
  },
  "299": {
    "type": "game_over",
    "text": "It would be extremely dangerous for you to enter Port Blacksand again... There is nothing else you can do but to make the long walk back to Silverton to report that you have failed in your mission."
  },
  "300": {
    "type": "transaction",
    "text": "The street makes a sudden right turn and heads north... a small boy... hands you a piece of paper... 'Arrows from six bows are pointed at you. Leave 10 Gold Pieces in the middle of the street and keep walking.'",
    "choices": {
      "Obey the instruction.": { "cost": 10, "next": "347_effect" },
      "Keep walking without leaving the gold.": { "cost": 0, "next": "137" }
    }
  },
  "301": {
    "type": "choice",
    "text": "There is a battle-axe held in the iron-plated glove of the armour.",
    "choices": {
      "Take the battle-axe.": "214",
      "Push the suit of armour on to the floor.": "185"
    }
  },
  "302": {
    "type": "transaction",
    "text": "You show the man the two gems... He turns to face you and offers you 9 Gold Pieces for the two.",
    "choices": {
      "Accept the offer.": { "cost": 0, "next": "240_effect_sell_gems" },
      "Haggle for a better deal.": { "cost": 0, "next": "345" }
    }
  },
  "240_effect_sell_gems": {
    "type": "effect",
    "effects": { "gold": 9, "remove_items": ["Two Gems"] },
    "next": "240_choice"
  },
  "303": {
    "type": "effect",
    "text": "You bend over the motionless body of the dead Hag and you cut off a tuft of her hair with your sword. You put the hair safely in your backpack and walk back down the tunnel to the entrance hole.",
    "effects": { "add_items": ["Hag's Hair"] },
    "next": "104"
  },
  "304": {
    "type": "auto",
    "text": "You arrive at a four-way junction in the street. The street leading west is called Key Street and the street leading east is called Clock Street. Ahead you see that Market Street continues north and a crowd of people are walking up it... You decide to follow them.",
    "next": "148"
  },
  "305": {
    "type": "effect",
    "text": "You point the mirror at the Spirit Stalker, but it does not stop him advancing. Again he manages to touch your flesh and burn you.",
    "effects": { "stamina": -2 },
    "next": "305_choice"
  },
  "305_choice": {
    "type": "choice",
    "text": "If you are still alive, what will you do?",
    "choices": {
      "Fire your silver arrow at him.": "189",
      "Fire your Ring of Ice at him (if you have one).": "35_check_ice_ring"
    }
  },
  "306": {
    "type": "effect",
    "text": "The two guards look at each other in horror and run out of the cell... a search of the room reveals 2 Gold Pieces and a merchant's pass... Taking your findings, you... creep outside into the city.",
    "effects": { "gold": 2, "add_items": ["Merchant's Pass"] },
    "next": "74"
  },
  "307": {
    "type": "choice",
    "text": "Walking towards you along the street are two huge guards wearing the black uniform of Lord Azzur... they are Trolls... To your right there is a tree which reaches almost to the top of the city wall.",
    "choices": {
      "Risk walking past the Trolls.": "290",
      "Climb the tree in order to get over the wall.": "11"
    }
  },
  "308": {
    "type": "auto",
    "text": "There is nothing to be found in the alleyway so you return to Harbour Street and turn left.",
    "next": "180"
  },
  "309": {
    "type": "combat",
    "text": "You shake the WOLF off your arm and draw your sword. The wolf snarls and leaps at you again.",
    "enemies": ["wolf_1"],
    "outcomes": { "win": "97", "lose": "GAME_OVER" }
  },
  "310": {
    "type": "choice",
    "text": "You climb up to the third floor and see another door at the end of the landing.",
    "choices": {
      "Open the door.": "263",
      "Climb to the next floor.": "65"
    }
  },
  "311": {
    "type": "combat",
    "text": "As you start your fight with the GUARD, you see two more armed men appear... They draw their swords and await the outcome of your battle.",
    "enemies": ["city_guard_1"],
    "outcomes": { "win": "311_multi_combat", "lose": "GAME_OVER" }
  },
  "311_multi_combat": {
    "type": "multi_combat",
    "text": "You defeat the first city guard, but now you must fight the other two as a pair.",
    "enemies": ["city_guard_10", "city_guard_11"],
    "outcomes": { "win": "74", "lose": "GAME_OVER" }
  },
  "312": {
    "type": "effect",
    "text": "You notice that the Ape Man's left hand is curled into a fist. You prise open the fingers and find a tiny gold trinket in the shape of an owl... You place the owl carefully in your pocket and continue your journey.",
    "effects": { "add_items": ["Golden Owl"] },
    "next": "217"
  },
  "313": {
    "type": "auto",
    "text": "You retrieve your sword from the dead man's chest and hurry out of the house. Relieved to be in the open air again you set off north.",
    "next": "304"
  },
  "314": {
    "type": "choice",
    "text": "As you slump down on the cold stone floor, you inadvertently knock over a glass jar... From the broken jar a small man... steps out... 'Now how can I repay you?'",
    "choices": {
      "Ask the whereabouts of Zanbar Bone.": "234",
      "Ask if he can heal some of your wounds.": "94"
    }
  },
  "315": {
    "type": "transaction",
    "text": "The creature leads you downstairs... and asks if you require fortune or good health. It takes the gold and silver scorpions out of their bowls and tells you that they are magic brooches. Each costs 6 Gold Pieces but you may only buy one.",
    "choices": {
      "Buy the golden brooch for fortune.": { "cost": 6, "next": "8" },
      "Buy the silver brooch for good health.": { "cost": 6, "next": "132" }
    }
  },
  "316": {
    "type": "auto",
    "text": "Once again you walk into the tattooist's shop and are greeted by Jimmy Quicktint. He is obviously pleased that you are back to give him some business.",
    "next": "279"
  },
  "317": {
    "type": "choice",
    "text": "One of the shops to your left is a candle-maker's. There are many different coloured candles burning brightly in the window.",
    "choices": {
      "Enter the shop.": "241",
      "Continue east.": "280"
    }
  },
  "318": {
    "type": "auto",
    "text": "The skull somehow attracts and absorbs all the power of the lightning bolt, leaving you unharmed. The fat man is angry but powerless and you are able to leave the house by the front door. Once outside you set off north again.",
    "next": "304"
  },
  "319": {
    "type": "choice",
    "text": "You enter a room which is dark and very cold... The room is empty except for a decorated sarcophagus.",
    "choices": {
      "Open the sarcophagus.": "352",
      "Walk outside again.": "231"
    }
  },
  "320": {
    "type": "auto",
    "text": "The jolly fishwives... tell you that there is a tale that Hags have been seen disappearing down sewers to catch rats for their stew-pots... You decide to leave the ladies; you then walk back to the junction and turn left into Clog Street.",
    "next": "216"
  },
  "321": {
    "type": "choice",
    "text": "At the bottom of the ladder you realize, much to your disgust, that you are standing in a sewer.",
    "choices": {
      "Walk north along the tunnel.": "356",
      "Walk south.": "118"
    }
  },
  "322": {
    "type": "effect",
    "text": "You walk back into the shop; behind the counter you find a small wooden money box. Inside it are 11 Gold Pieces... You decide that it is time to leave the shop and head north.",
    "effects": { "gold": 11 },
    "next": "93"
  },
  "323": {
    "type": "combat",
    "text": "The blacksmith looks surprised at your unprovoked aggression and pulls another red-hot iron bar from the fire... He is very angry and lunges at you with the bar.",
    "enemies": ["blacksmith_1"],
    "rules": { "player_extra_damage_on_hit": 1 },
    "outcomes": { "win": "395", "lose": "GAME_OVER" }
  },
  "324": {
    "type": "effect",
    "text": "The box shatters and you see two gems, 15 Gold Pieces and a white silk glove lying amidst the broken pieces of wood.",
    "effects": { "gold": 15, "add_items": ["Two Gems", "White Silk Glove"] },
    "next": "324_choice"
  },
  "324_choice": {
    "type": "choice",
    "text": "What do you do?",
    "choices": {
      "Try on the glove.": "89",
      "Leave the house, taking only the gems and the gold.": "282"
    }
  },
  "325": {
    "type": "effect",
    "text": "You follow the old man... he opens his leather bag and places two small pots on the table... you rub some of the cream on your wounds too... you are surprised to feel the healing effect... Add 5 STAMINA points. After finishing your drink, you... leave the tavern and head north.",
    "effects": { "stamina": 5 },
    "next": "348"
  },
  "326": {
    "type": "multi_combat",
    "text": "Suddenly you hear growling... You draw your sword just in time as two WILD DOGS... leap at you. Fight both dogs at the same time.",
    "enemies": ["wild_dog_1", "wild_dog_2"],
    "rules": { "escape_unconditional": "180" },
    "outcomes": { "win": "184", "lose": "GAME_OVER" }
  },
  "327": {
    "type": "choice",
    "text": "You feel like a pincushion... Ahead to your right you see the door of one of the houses opening and a little girl... She beckons you to enter the house.",
    "choices": {
      "Enter the house.": "126",
      "Continue walking north.": "164"
    }
  },
  "328": {
    "type": "effect",
    "text": "You take the silver item out of your backpack and hand it to the Serpent Queen. She is delighted... She shows you to the front door and tips you 2 Gold Pieces. Outside you set off north.",
    "effects": { "lose_silver_item_bribe": 1, "gold": 2 },
    "next": "333"
  },
  "329": {
    "type": "effect",
    "text": "Before you stands a white-haired old man... 'Explain yourself to Nicodemus.'... He tells you how to defeat Zanbar Bone... Nicodemus then draws you a map...",
    "effects": { "add_items": ["Map to Zanbar's Tower"] },
    "next": "329_choice"
  },
  "329_choice": {
    "type": "choice",
    "text": "You leave his hut, climb the steps and cross the bridge over Catfish River... Bridge Street continues north a short distance before ending at a junction.",
    "choices": {
      "Walk west down Harbour Street.": "91",
      "Turn east down Candle Street.": "238"
    }
  },
  "330": {
    "type": "effect",
    "text": "The bolt lodges deeply in your shoulder. Lose 3 STAMINA points. If you are still alive you... pull the bolt from your shoulder. As you bandage your wound the little man runs off... you walk under the bridge and continue east.",
    "effects": { "stamina": -3 },
    "next": "30"
  },
  "331": {
    "type": "combat",
    "text": "As you approach the man, he suddenly springs up and screams... He produces a dagger from his ragged clothing and leaps at you. His wild eyes belong to a man insane or possessed...",
    "enemies": ["mad_man_1"],
    "outcomes": { "win": "86", "lose": "GAME_OVER" }
  },
  "332": {
    "type": "effect",
    "text": "The beggar tips his hat in gratitude and mumbles a few words. Add 1 Luck point before continuing west.",
    "effects": { "luck": 1, "gold": -1 },
    "next": "124"
  },
  "333": {
    "type": "auto",
    "text": "You soon reach a junction in the street. Stable Street continues north and to your left you see Tower Street leading west. You decide to keep going north.",
    "next": "76"
  },
  "334": {
    "type": "auto",
    "text": "Walking towards you down the street are two town guards. They stop in front of you and demand to see your papers.",
    "next": "334_condition"
  },
  "334_condition": {
    "type": "condition_item",
    "text": "Do you possess a merchant's pass?",
    "check": { "item": "Merchant's Pass" },
    "outcomes": { "success": "255", "failure": "99" }
  },
  "335": {
    "type": "choice",
    "text": "The larger of the two Trolls tells you that you are under arrest... He offers you a choice. You can pay a fine of all the gold in your backpack and be thrown out of the city, or spend a year in a dungeon.",
    "choices": {
      "Pay the fine and be thrown out.": "367",
      "Resist arrest.": "73"
    }
  },
  "336": {
    "type": "choice",
    "text": "Once inside... you realize it is a jeweller's shop... The man asks whether you are buying or selling.",
    "choices": {
      "Ask the price of the rings.": "36",
      "Offer to sell him gems (if you have them).": "336_condition",
      "Attack him with your sword.": "170"
    }
  },
  "336_condition": {
    "type": "condition_item",
    "check": { "item": "Gems" },
    "outcomes": { "success": "302", "failure": "336_no_gems" }
  },
  "336_no_gems": {
    "type": "auto",
    "text": "You have no gems to sell.",
    "next": "336"
  },
  "337": {
    "type": "victory",
    "text": "Congratulations - you have killed Zanbar Bone, the infamous Night Prince. He decays before your eyes, becoming nothing more than a small pile of powder on the floor."
  },
  "338": {
    "type": "effect",
    "text": "You have just swallowed a Potion of Misfortune. Reduce your Luck by 3 points. Hoping for better luck ahead you set off north again.",
    "effects": { "luck": -3 },
    "next": "105"
  },
  "339": {
    "type": "choice",
    "text": "The man looks at you and smiles, saying, '...I am sure my master would wish you to have a room for the night. Do come in.'... He tells you that this is your room for the night...",
    "choices": {
      "Lock the door and go to bed.": "288",
      "Explore the tower after waiting a few minutes.": "77"
    }
  },
  "340": {
    "type": "effect",
    "text": "Once more you poke the wire inside the lock and finally it turns. Add 1 Luck point. Raising the lid of the chest you see... 25 Gold Pieces and a magnificent shield. If you use this shield in battle, it will increase your Attack Strength by 1...",
    "effects": { "luck": 1, "gold": 25, "add_items": ["Magic Shield (+1 AS)"] },
    "next": "340_choice"
  },
  "340_choice": {
    "type": "choice",
    "text": "What now?",
    "choices": {
      "Climb the stairs to the floor above.": "60",
      "Leave the house to head north.": "304"
    }
  },
  "341": {
    "type": "effect",
    "text": "You decide that you are going to have to make a run for it... You take 5 Gold Pieces... and throw them on the floor... As you run off, the escaped murderer starts to yell and two of the guards chase after you... You dive into a large open barrel... Once more you set off north.",
    "effects": { "gold": -5 },
    "next": "222"
  },
  "342": {
    "type": "transaction",
    "text": "The Man-Orc tells you that for 1 Gold Piece he will tell you all he knows.",
    "choices": {
      "Pay for his information.": { "cost": 1, "next": "289" },
      "Leave the shop.": { "cost": 0, "next": "93" }
    }
  },
  "343": {
    "type": "effect",
    "text": "You fall to the floor, unconscious. Lose 3 STAMINA points. If you are still alive, you awake to find yourself lying outside the shop in Clog Street. You will find that any silver items you had are now missing. You stand up and set off angrily along the street.",
    "effects": { "stamina": -3, "lose_silver_items": 1 },
    "next": "100"
  },
  "344": {
    "type": "choice",
    "text": "You step out into the middle of the street and wait. Suddenly a pair of horses come galloping into view pulling an ornate gold carriage. The driver sees you and, cracking his whip, yells, 'Make way for Lord Azzur!'",
    "choices": {
      "Step out of the path of the oncoming carriage.": "58",
      "Stay where you are.": "252"
    }
  },
  "345": {
    "type": "choice",
    "text": "The man frowns and thumps his fist down on top of the counter, shouting, 'This is not a bazaar! ...Now get out of my shop before I slice you in two.'",
    "choices": {
      "Calm him down and accept his offer.": "240_effect_sell_gems",
      "Walk out of the shop and head west.": "196",
      "Attack him with your sword.": "170"
    }
  },
  "346": {
    "type": "game_over",
    "text": "The distance to the ground is too great even for a great warrior like yourself. You land badly and break your neck. Your adventure ends here."
  },
  "347_effect": {
    "type": "effect",
    "text": "You leave 10 Gold Pieces in the middle of the street.",
    "effects": { "luck": -2 },
    "next": "347"
  },
  "347": {
    "type": "auto",
    "text": "You hurry on down the street but glance back after hearing cries of jubilation behind you... You curse this thieving city and press on north.",
    "next": "112"
  },
  "348": {
    "type": "choice",
    "text": "Tower Street makes a sharp turn to the right... An iron bridge crosses overhead... and you see movement on it. Small cloaked people are carrying laden sacks...",
    "choices": {
      "Call out to them.": "251",
      "Walk under the bridge and continue east.": "30"
    }
  },
  "349": {
    "type": "combat",
    "text": "Suddenly you are confronted by a small winged creature... It is red in colour and has two horns... It will be difficult to defeat as it flies quickly about your head spitting fire at you!",
    "enemies": ["fire_imp_1"],
    "rules": { "escape_unconditional": "192" },
    "outcomes": { "win": "258", "lose": "GAME_OVER" }
  },
  "350": {
    "type": "choice",
    "text": "You open your backpack and pretend to search for the flowers. The Serpent Queen starts to fidget... You cannot think of a good plan and start to panic.",
    "choices": {
      "Run to the front door.": "32",
      "Draw your sword to attack her.": "249"
    }
  },
  "351": {
    "type": "combat",
    "text": "The two guards are relaxing over a game of cards. You wave your sword in the air and charge at them. They grab their swords to defend themselves and fight you one at a time.",
    "enemies": ["city_guard_8", "city_guard_9"],
    "outcomes": { "win": "54", "lose": "GAME_OVER" }
  },
  "352": {
    "type": "auto",
    "text": "You lift the lid of the sarcophagus and see a human body completely encased in old bandages... it starts to climb out... It walks towards you with its arms extended.",
    "next": "352_condition"
  },
  "352_condition": {
    "type": "condition_item",
    "text": "Do you have a Lantern?",
    "check": { "item": "Lantern" },
    "outcomes": { "success": "106", "failure": "193" }
  },
  "353": {
    "type": "auto",
    "text": "You try to turn the large brass handle on the door but it is locked.",
    "next": "353_condition"
  },
  "353_condition": {
    "type": "condition_item",
    "text": "Do you have an iron key?",
    "check": { "item": "Iron Key" },
    "outcomes": { "success": "181", "failure": "353_choice" }
  },
  "353_choice": {
    "type": "choice",
    "text": "The door is locked.",
    "choices": {
      "Try to force the door open.": "389",
      "Return to the street to head north.": "304"
    }
  },
  "354": {
    "type": "pawn_shop",
    "text": "The tattooist... says, '...go next door. My step-brother... is a pawnbroker.'... He then tells you what he is currently interested in buying, and the prices he is offering:",
    "items": {
      "Silver Goblet": 8,
      "Skeleton Key": 15,
      "Scorpion Brooch": 10,
      "Magic Ring": 12,
      "Silver Bracelet": 5,
      "Helmet": 7,
      "Silver Flute": 5,
      "Eye-patch": 1,
      "Knucklebones": 1,
      "Mirror": 1
    },
    "next": "354_condition"
  },
  "354_condition": {
    "type": "condition_gold",
    "text": "You bid him farewell and walk outside. Do you have enough money for the tattoo?",
    "check": { "amount": 10 },
    "outcomes": { "success": "316", "failure": "307" }
  },
  "355": {
    "type": "auto",
    "text": "You turn on the two guards who were holding you and, before they realize what is happening, you smash their heads together, knocking them unconscious. You dash into the city.",
    "next": "74"
  },
  "356": {
    "type": "combat",
    "text": "Ahead you hear the sound of squealing and frantic splashing... you see the sleek, glistening shapes of three GIANT RATS... You draw your sword hastily and fight each of the Rats in turn.",
    "enemies": ["giant_rat_1", "giant_rat_2", "giant_rat_3"],
    "outcomes": { "win": "28", "lose": "GAME_OVER" }
  },
  "357": {
    "type": "combat",
    "text": "The OGRE is mad with hunger and picks up a large bone off the floor. He raises it above his head and lumbers towards you. You must fight him.",
    "enemies": ["ogre_1"],
    "rules": { "escape_after_rounds": { "rounds": 3, "page": "282" } },
    "outcomes": { "win": "71", "lose": "GAME_OVER" }
  },
  "358": {
    "type": "auto",
    "text": "It's a close shave, but you just manage to grip the edge of the wall... you climb on to a stone walkway... doors in the towers... are suddenly flung open as more guards run out to capture you. There is a twenty-metre drop on the other side of the wall.",
    "next": "358_choice"
  },
  "358_choice": {
    "type": "choice",
    "text": "What do you do?",
    "choices": {
      "Jump to freedom.": "346",
      "Fix a Climbing Rope (if you have one).": "358_condition",
      "Face the oncoming guards.": "56"
    }
  },
  "358_condition": {
    "type": "condition_item",
    "check": { "item": "Climbing Rope" },
    "outcomes": { "success": "108", "failure": "358_choice" }
  },
  "359": {
    "type": "effect",
    "text": "All the Bays on your side rush over to you... Supporters run over and start handing you gifts... You have been given 8 Gold Pieces, a Potion of Mind Control, a silver flute, a bunch of bananas, a piece of chalk and an eye-patch. You eat the bananas.",
    "effects": {
      "gold": 8,
      "stamina": 2,
      "add_items": [
        "Potion of Mind Control",
        "Silver Flute",
        "Chalk",
        "Eye-patch"
      ]
    },
    "next": "91"
  },
  "360": {
    "type": "choice",
    "text": "During your fight with the Wolf Dogs, Wraggins runs out of the front of the shop, perhaps to fetch help.",
    "choices": {
      "Stay and search the shop.": "123",
      "Hurry out and continue west.": "300"
    }
  },
  "361": {
    "type": "combat",
    "text": "The mindless ZOMBIES step slowly towards you with their sticks raised in the air. Fight them one at a time.",
    "enemies": ["zombie_1", "zombie_2"],
    "outcomes": { "win": "297", "lose": "GAME_OVER" }
  },
  "362": {
    "type": "effect",
    "text": "The boots fit perfectly and walking about you feel very sure-footed. They are magic elven boots. Add 1 SKILL point to your total and set off east again.",
    "effects": { "skill": 1, "add_items": ["Elven Boots"] },
    "next": "103"
  },
  "363": {
    "type": "choice",
    "text": "In the middle of the street you see a large manhole cover.",
    "choices": {
      "Lift the manhole cover.": "48",
      "Keep walking east.": "205"
    }
  },
  "364": {
    "type": "effect",
    "text": "The gaunt-faced man... says, 'For 2 Gold Pieces, I'll tell you where he is.' You decide to trust the man and pay him... He pockets the gold and says, 'You are standing on top of him! Nicodemus lives in a hut underneath this bridge.'",
    "effects": { "gold": -2 },
    "next": "329"
  },
  "365": {
    "type": "effect",
    "text": "You charge the door several times before it splinters. Unfortunately, you injure your shoulder in the process. Lose 1 SKILL point.",
    "effects": { "skill": -1 },
    "next": "365_choice"
  },
  "365_choice": {
    "type": "choice",
    "text": "Through the broken door you see a thin, pale-skinned-man... 'Really, do you have to make such a dramatic entry?'",
    "choices": {
      "Apologize and tell him that you are a lost traveller.": "339",
      "Attack him with your sword.": "35"
    }
  },
  "366_transact": {
    "type": "transaction",
    "choices": { "Buy smoking mixture": { "cost": 1, "next": "366" } }
  },
  "366": {
    "type": "effect",
    "text": "You pay for the smoking mixture... The smoke is dark and tastes awful... Lose 2 STAMINA points.",
    "effects": { "stamina": -2 },
    "next": "366_choice"
  },
  "366_choice": {
    "type": "choice",
    "text": "What do you do?",
    "choices": {
      "Go back to the herbalist to complain.": "101",
      "Walk north again.": "93"
    }
  },
  "367": {
    "type": "effect",
    "text": "The Trolls watch carefully as you open your backpack. You give them all your gold except for 1 Gold Piece which you manage to palm without their noticing. They then march you to the city's North Gate... and give you a forceful boot up the backside.",
    "effects": { "lose_all_gold_but_one": 1 },
    "next": "156_condition"
  },
  "368": {
    "type": "effect",
    "text": "You pay to hear her predictions. Looking into a crystal ball, she tells you that the man you are looking for lives in a hut beneath a bridge to the north... Then she looks away... and asks you to leave.",
    "effects": { "gold": -2 },
    "next": "117"
  },
  "369": {
    "type": "auto",
    "text": "Back at the junction you turn left into Clog Street and walk eastwards.",
    "next": "216"
  },
  "370": {
    "type": "choice",
    "text": "You place the coin in the slot and walk through the turnstile... In the middle there is a stone plinth upon which sits a large earthen bowl containing lotus flowers! ... The gardener is nowhere to be seen.",
    "choices": {
      "Risk picking one of the flowers.": "14",
      "Leave the gardens and continue north.": "133"
    }
  },
  "371": {
    "type": "choice",
    "text": "In the back room of the shop you find a glass jar on a dusty shelf labelled 'Healing Mixture'.",
    "choices": {
      "Apply some of it to your wounds.": "83",
      "Continue searching the shop.": "322"
    }
  },
  "372": {
    "type": "choice",
    "text": "The houses in this section of Stable Street consist of two rows of terraces... one... is made of brick and is painted white. The door is made of oak and a serpent's head is carved into it.",
    "choices": {
      "Enter the white house.": "131",
      "Keep walking north.": "333"
    }
  },
  "373": {
    "type": "effect",
    "text": "You grimace as you feel the poison creep up your arm. Lose 4 STAMINA points and 1 SKILL point.",
    "effects": { "stamina": -4, "skill": -1 },
    "next": "373_choice"
  },
  "373_choice": {
    "type": "choice",
    "text": "If you are still alive, what will you do?",
    "choices": {
      "Lift goblet B (if not done).": "209",
      "Lift goblet C (if not done).": "43",
      "Walk through the archway.": "107",
      "Climb the stairs.": "60"
    }
  },
  "374": {
    "type": "effect",
    "text": "The shield was taken from a goodly knight... It was forged with good magic. Add 1 SKILL point. You walk over to the spiral staircase with your new shield and climb to the floor above.",
    "effects": { "skill": 1, "add_items": ["Unicorn Shield"] },
    "next": "21"
  },
  "375": {
    "type": "choice",
    "text": "Eventually the street comes to a dead end at a high stone wall. There are stone steps leading to the top of the wall. On the other side... you can hear grunts, growls and cheering.",
    "choices": {
      "Climb over the wall.": "40",
      "Walk back to the junction and head west.": "91"
    }
  },
  "376": {
    "type": "effect",
    "text": "You place the magnificent winged helmet on your head.",
    "effects": { "add_items": ["Winged Helmet"] },
    "next": "161"
  },
  "377": {
    "type": "choice",
    "text": "The iron grill is securely bolted... you are unable to remove it. However, above the grill you notice a dark recess where some bricks have been removed...",
    "choices": {
      "Put your hand into the dark hole.": "92",
      "Walk back to the entrance hole.": "174"
    }
  },
  "378": {
    "type": "dice_game",
    "text": "The bare-chested man... states that whoever drops a cannon-ball must pay the other 5 Gold Pieces. Roll one die alternately... until a 1 is thrown.",
    "rules": { "game_type": "hot_potato", "wager": 5 },
    "next": "52"
  },
  "379": {
    "type": "effect",
    "text": "The blade cuts into your left arm. Lose 2 STAMINA points.",
    "effects": { "stamina": -2 },
    "next": "158"
  },
  "380": {
    "type": "effect",
    "text": "Despite its rotten taste, the soup includes herbs... beneficial to health. Add 4 STAMINA points. Feeling somewhat revitalized you decide to leave... and head east.",
    "effects": { "stamina": 4 },
    "next": "375"
  },
  "381": {
    "type": "transaction",
    "text": "The guard frowns... 'You may enter at your own peril or buy my advice for 3 Gold Pieces.'",
    "choices": {
      "Head straight into the city.": { "cost": 0, "next": "74" },
      "Buy the guard's advice.": { "cost": 3, "next": "261" }
    }
  },
  "382": {
    "type": "auto",
    "text": "A jet of gas shoots out of the ring and turns to ice... It does not stop him advancing... but it slows him down... your Ring of Ice is useless.",
    "effects": { "remove_items": ["Ring of Ice"] },
    "next": "382_choice"
  },
  "382_choice": {
    "type": "choice",
    "text": "You have time for one more action.",
    "choices": {
      "Fire your silver arrow at him.": "189",
      "Reflect his stare in your mirror.": "305"
    }
  },
  "383": {
    "type": "choice",
    "text": "You close the door.",
    "choices": {
      "Open the other door (if not done).": "271",
      "Leave the ship and walk north.": "78"
    }
  },
  "384": {
    "type": "choice",
    "text": "As the cudgel swings... you punch the Dwarf holding it... The other two Dwarfs... run off after their fellow-robber.",
    "choices": {
      "Chase them down the alley.": "221",
      "Set off west again.": "396"
    }
  },
  "385": {
    "type": "combat",
    "text": "A voice in your mind tells you that the chest is an illusion... Before you stands... Zanbar Bone! ...he pulls three teeth from his mouth and throws them on to the floor. They explode... and out of them step three SKELETONS... Fight them one at a time.",
    "enemies": ["skeleton_1", "skeleton_2", "skeleton_3"],
    "outcomes": { "win": "203", "lose": "GAME_OVER" }
  },
  "386": {
    "type": "combat",
    "text": "The PIRATE seems pleased that you wish to fight him and grins, revealing a toothless mouth which unnerves you a little.",
    "enemies": ["pirate_5"],
    "outcomes": { "win": "20", "lose": "GAME_OVER" }
  },
  "387_effect": {
    "type": "effect",
    "text": "You find 4 Gold Pieces and pick up the copper brooch.",
    "effects": { "gold": 4 },
    "next": "387"
  },
  "387": {
    "type": "effect",
    "text": "You are now wearing a brooch that slows you down in combat without your realizing it. Reduce your SKILL by 1 point. Finding nothing else of interest... you leave the house to head north.",
    "effects": { "skill": -1, "add_items": ["Cursed Copper Brooch"] },
    "next": "334"
  },
  "388": {
    "type": "auto",
    "text": "You try with all your might to bend the bars securing the glass cupboard but you are unable to open it. Finding nothing else of interest... you walk outside and continue east.",
    "next": "100"
  },
  "389": {
    "type": "skill_test",
    "text": "You push the door with your shoulder with all your might. Roll two dice.",
    "outcomes": { "success": "159", "failure": "304" }
  },
  "390": {
    "type": "luck_test",
    "text": "The HAG is conjuring a spell which instils terrible fear in you... You swing your sword around blindly... Test your Luck.",
    "outcomes": { "lucky": "144", "unlucky": "59" }
  },
  "391": {
    "type": "luck_test",
    "text": "Unbeknown to you, there is a trip-wire across the doorway... as you walk into the room you trigger the wire and this releases a crossbow bolt straight at you. Test your Luck.",
    "outcomes": { "lucky": "235", "unlucky": "142" }
  },
  "392": {
    "type": "combat",
    "text": "The creature is outraged that you have stolen one of its brooches... Suddenly a blast of fire shoots from its jaw... but you must fight the creature.",
    "enemies": ["lizardine_1"],
    "rules": {
      "enemy_extra_damage_on_roll": {
        "roll": "1d6",
        "threshold": 3,
        "damage": 1
      },
      "escape_unconditional": "334"
    },
    "outcomes": { "win": "186", "lose": "GAME_OVER" }
  },
  "393": {
    "type": "choice",
    "text": "You tell the Trolls that you are a weapon-maker... Sourbelly sneers at you and says, 'Well in that case you have finished your business in Port Blacksand. Allow us to escort you to the city gates.'",
    "choices": {
      "Let them throw you out of the city.": "156",
      "Attack the Trolls.": "73"
    }
  },
  "394": {
    "type": "transaction",
    "text": "Sitting behind a small table is a plump woman... She tells you that a glimpse of the future will cost you 2 Gold Pieces.",
    "choices": {
      "Pay to hear her predictions.": { "cost": 2, "next": "368" },
      "Carry on unaided.": { "cost": 0, "next": "117" }
    }
  },
  "395": {
    "type": "effect",
    "text": "The blacksmith was a good man. Lose 4 LUCK points. Feeling extremely guilty, you leave the stable and continue north.",
    "effects": { "luck": -4 },
    "next": "115"
  },
  "396": {
    "type": "choice",
    "text": "On the left side of the street is a flower shop. The window is filled with exotic and colourful flowers.",
    "choices": {
      "Enter the shop.": "145",
      "Keep walking west.": "24"
    }
  },
  "397": {
    "type": "effect",
    "text": "No wonder the vagabonds wanted to rob you - they only have 1 Gold Piece between them... You find nothing else of interest... and so decide to set off north along Stable Street.",
    "effects": { "gold": 1 },
    "next": "372"
  },
  "398": {
    "type": "choice",
    "text": "A small circle of people is standing around a bare-chested man... He is asking the crowd for a volunteer to play catch with a cannon-ball... whoever drops the cannon-ball must pay the other 5 Gold Pieces.",
    "choices": {
      "Take him on at his game.": "378",
      "Walk on.": "52"
    }
  },
  "399": {
    "type": "choice",
    "text": "A rope ladder hangs down from the stern of the ship to the jetty. There is also a gangplank leading up the side of the ship.",
    "choices": {
      "Board the ship by climbing the rope ladder.": "87",
      "Walk straight up the gangplank.": "294"
    }
  },
  "400": {
    "type": "victory",
    "text": "You leave Zanbar Bone's black tower as quickly as you can... You arrive in Silverton the same evening. You are given a hero's welcome... The people of Silverton are joyous once again."
  }
}
